[{"name": "AMERIA Investment Consulting Company", "location": "Yerevan, Armenia", "description": "AMERIA Investment Consulting Company is seeking a\nChief Financial Officer. This position manages the company's fiscal and\nadministrative functions, provides highly responsible and technically\ncomplex staff assistance to the Executive Director. The work performed\nrequires a high level of technical proficiency in financial management\nand investment management, as well as management, supervisory, and\nadministrative skills.", "qualification": "To perform this job successfully, an\nindividual must be able to perform each essential duty satisfactorily.\nThe requirements listed below are representative of the knowledge,\nskill, and/or ability required.\nKnowledge of:\n- Generally accepted accounting principles;\n- Local accounting standards and legislation;\n- State reporting requirements pertaining to accounting;\n- Principles and practices of financial management and budgeting;\n- Principles and practices of financial systems design and analysis;\n- Principles and practices of contract management, records management,\nand risk management;\n- Principles and practices of management and supervision;\n- Principles and practices of information systems management.\nAbility to:\n- Apply sound fiscal and administrative practices to the company's\nactivities;\n- Plan, organize and supervise the work of subordinate employees,\nincluding training them, assigning and evaluating their work, and\nproviding job performance feedback;\n- Critically analyze fiscal and administrative policies, practices,\nprocedures, and systems, and recommend and implement changes as needed;\n- Gather and synthesize financial information from a variety of sources\nand present it to a variety of audiences with differing financial\nmanagement and analysis expertise;\n- Prepare detailed, comprehensive financial reports, including\nexplanatory text;\n- Operate IBM-compatible personal computer, including word processing,\nspreadsheet, and database software applications;\n- Operate specialized software applications that support the financial\nmanagement and budgeting functions.\nQualifications:\n- A minimum of 5-7 years Accounting/ Corporate Finance/ Banking\nexperience, including a role as a CFO;\n- Excellent finance and accounting technical skills coupled with a\ndemonstrated knowledge of all key financial functions in an consulting\ncompany context - accounting, finance, control, treasury, reserving, and\nreporting;\n- Strong financial planning and analytical skills and experience and the\nability to work closely with and support the CEO and other executives in\nstrategic development and implementation;\n- Excellent leadership, management and supervisory track record of\nattracting, selecting, developing, rewarding and retaining high-caliber,\naccounting and finance executive and teams who achieve business goals;\n- An undergraduate degree in finance, business, or other related\ndiscipline is required. A CPA, CFA, ACCA or other financial\ncertification is highly preferred, as is a Masters degree in Business\nAdministration, Accounting or Finance;\n- Fluency in English, Armenian and Russian with outstanding writing\nskills;\n- Excellent analytical, communication, teamwork, interpersonal skills;\n- Need to be well organized and detail-oriented as well as goal/ result\ndriven and able to deal with complex issues."}, {"name": "International Research & Exchanges Board (IREX)", "location": "IREX Armenia Main Office; Yerevan, Armenia \nDESCRIPTION:   IREX currently seeks to fill the position of a paid\nIntern for the Community Connections (CC) Program. The position is based\nin the Yerevan office however applicants must be willing to travel\nthroughout Armenia as necessary.  This position reports directly to the\nCC Program Manager.\nRESPONSIBILITIES:  \n- Presenting the CC program to interested parties; \n- Assisting in planning and scheduling of programmatic meetings and\nevents (this includes coordinating logistics for CC staff, visitors and\nparticipants);\n- Assisting the Program Staff;\n- Translation/Interpretation from Armenian to English and vice versa;\n- Helping create, maintain and update the CC filing system and\ndatabases;\n- Completing general administrative tasks for the CC program within the\noffice;\n- Other duties as assigned/ needed.", "description": "NA", "qualification": "- Bachelor's Degree; Master's is preferred;\n- Excellent skills in spoken and written English and Armenian languages;\n- Past English to Armenian translation and Armenian to English\ntranslation experience;\n- Good communication and public speaking skills;\n- Ability to work independently and as part of a team.\nREMUNERATION:  Commensurate with experience."}, {"name": "Caucasus Environmental NGO Network (CENN)", "location": "Yerevan, Armenia", "description": "Public outreach and strengthening of a growing\nnetwork of environmental NGOs, businesses, international organizations\nand public agencies. Will serve as primary contact between CENN and\npublic. This is a full-time position.", "qualification": "- Degree in environmentally related field, or 5 years relevant\nexperience;\n- Oral and written fluency in Armenian, Russian and English;\n- Knowledge/ experience of working with environmental issues specific to\nArmenia is a plus.\nREMUNERATION:  Salary commensurate with experience."}, {"name": "Manoff Group", "location": "Manila, Philippines", "description": "The LEAD (Local Enhancement and Development for\nHealth) BCC Specialist will apply state-of-the-art approaches in working\nwith LGUs (Local Government Units) and NGOs to help them to identify and\naddress provider-caused barriers to service provision as well as to\nidentify and address supports for good service delivery by developing\ntools that may be adapted to each LGU's needs. S/he will work with LEAD\nstaff across all components to support quality service delivery and will\nalso monitor implementation of improved service delivery in LGUs, and\nwill provide additional assistance to LGUs and NGOs, as needed. S/he\nwill collect all relevant published and grey literature documents,\nidentify gaps in knowledge, and work with NGOs and consultants to fill\nin the gaps. S/he will establish training for NGOs and LGU\nadministration staff pursuing service enhancement and provider behavior\nchange and will oversee the training. S/he will serve as the Project's\nprimary liaison to TSAP and other projects and organizations working in\nbehavior change.", "qualification": "- Advanced degree in public health, social science, or communication or\nrelated experience;\n- Familiarity with Behavior-centered Programming SM preferred;\n- At least five years experience in the design, implementation, and\nmonitoring/evaluation of behavior change programs in the developing\nworld, preferably including Philippines;\n- Experience with behavior change in reproductive health and/or family\nplanning programs;\n- Excellent communication, coordination, and facilitation skills;\n- Experience with PC-based software, including word processing and basic\nspreadsheet analysis;\n- Knowledge of a language of the Philippines, or willingness to learn;\n- High level of written and spoken English fluency."}, {"name": "Yerevan Brandy Company", "location": "Yerevan, Armenia", "description": "NA", "qualification": "- University degree; economical background is a plus;\n- Excellent knowledge of Windows 2000 Server, Networking TCP/ IP\ntechnologies, MS SQL 2000 Server, Visual Basic 6;\n- At least 2 years of experience in database software development;\n- Good knowledge of English.\nREMUNERATION:  Will be commensurate with the norms accepted in the\nCompany."}, {"name": "Boutique \"Appollo\"", "location": "Yerevan, Armenia\nWORK HOURS: 10:00 - 20:00; one free day per week.", "description": "Saleswoman will sell menswear and accessories.", "qualification": "- Candidates should be female, 20-30 years old;\n- Nice-looking exterior; \n- Excellent communication skills;\n- Fluency in Armenian and Russian;  \n- Good knowledge of English (oral).\nREMUNERATION:  Starting salary - 40,000 AMD."}, {"name": "OSI Assistance Foundation - Armenian Branch Office", "location": "Yerevan, Armenia", "description": "The Armenian Branch Office of the Open Society\nInstitute Assistance Foundation is seeking applications for the position\nof Chief Accountant/ Finance Assistant. The Chief Accountant/ Finance\nAssistant will be responsible for all transactions, connected with grant\npayments, administrative expenses.", "qualification": "- University degree in finance/ accounting; \n- One year minimum experience in an international organization; \n- Strong organizational skills; \n- Good knowledge of software programs: MS Excel and MS Access; \n- Good knowledge of IAS, Armenian taxation laws, reporting requirements\nand current reforms; \n- Discretion and ability to handle confidential issues; \n- Self-motivation with an ability to set and meet goals; \n- Quick learning skills; \n- Fluency in English, Armenian and Russian."}, {"name": "International Research & Exchanges Board (IREX)", "location": "IREX Armenia Main Office\nDESCRIPTION:   IREX currently seeks to fill the position of non-paid\nfull and part time Programmatic Intern. The position is based in the\nYerevan office. This position reports directly to the Administrative\nCoordinator or Program Manager.\nThe internship program serves to:\n- Reinforce and strengthen the interns' personal values and career\nobjectives through an improved understanding of themselves and the work\nenvironment;\n- Assist students in identifying and acquiring the skills needed to\nenter a chosen field;\n- Provide practical work experience to balance the students' theoretical\ntraining;\n- Allow students to meet and learn from professionals in the field and\ndevelop a network of contacts.\nInternship Areas:\nAdministrative Internship\nThe IREX Administrative Internship provides interns with experience in\nthe areas of public relations, secretarial support, translation and\ninterpretation.  Interns will be responsible for greeting visitors,\nresponding to walk in and telephone inquiries about IREX and its\nprograms, directing office communications to appropriate staff, editing\nof written text, assisting with daily administrative tasks such as\nwritten translation, oral interpretation, filing, copying, faxing,\ndrafting correspondence, research, and other duties as needed.\nProgram Internships\nThe IREX Program Internship provides interns with experience working\ndirectly with one or more of IREX's programs including public relations\nand outreach, event coordination, and administrative tasks related to\nspecific programs.  Interns will be responsible for responding to walk\nin and telephone inquiries related to the program, assisting program\nstaff with public outreach campaigns, assisting in the development and\nediting of outreach materials, assisting in event coordination and\nprogram related research, and various administrative tasks including but\nnot limited to written translation, oral interpretation, filing,\ncopying, faxing, and drafting correspondence.  IREX Program Interns are\nassigned to programs according to program needs, technical resources\navailable, and intern skills.  Possible placements include: the\nEducational Information Center (EIC) and Computer Based Testing Center,\nthe Internet Access Training Program (IATP), the Community Connection\nExchange Program, Partnerships and Training Division Education\nCurriculum Development Programs, and the Academic and Exchanges and\nResearch Division Alumni Program.", "description": "NA", "qualification": "NA"}, {"name": "Yerevan Brandy Company", "location": "Yerevan, Armenia", "description": "NA", "qualification": "- University degree;\n- At least 3 years of experience in the relevant field;\n- Mastership of the office work and competency of business ethics;\n- Excellent working knowledge of written and verbal Armenian, Russian\nand English; knowledge of French is a plus;\n- Knowledge of MS Office;\n- Strong problem-solving and organizational skills; outstanding\ninterpersonal skills.  \nREMUNERATION:  Will be commensurate with the norms accepted in the\nCompany"}, {"name": "American Embassy Yerevan\nANNOUNCEMENT NUMBER: 04-01", "location": "NA", "description": "The incumbent assists in coordinating INL-funded law\nenforcement and drug control programs in Armenia (including training\nprograms supported and implemented by US Agencies) to avoid duplication\nof effort with other programs and to ensure that assistance from various\nUSG agencies is complementary. Additionally, assists on coordinating US\nmission activities in the crime and narcotics area with other donors\nlike the United Nations, Non Governmental organizations and other\ninternational donors.\nA copy of the complete position description listing all duties and\nresponsibilities is available in the Human Resources Office. Contact\nnumber: (3741) 52-46-61", "qualification": "NOTE: All applicants are instructed to\naddress each selection criterion detailed below with specific and\ncomprehensive information supporting each criteria.\n- University degree in a relevant field (Law, Law Enforcement, Political\nScience, Public Administration) or its equivalent is required;\n- Two years of progressively responsible experience in program\nadministration and logistical support is required;\n- Level IV proficiency in English and Armenian;\n- Thorough knowledge of Armenian Criminal Justice System, legislative\nprocess, and structure and operations of law enforcement agencies\nrequired;\n- Sound management, analytical and organizational skills. \nSELECTION PROCESS:   When equally qualified, Eligible Family Members and\nU.S. Veterans will be given preference. Therefore, it is essential that\nall candidates address the required qualifications above in the\napplication. \nADDITIONAL SELECTION CRITERIA: \n1. Management will consider nepotism/ conflict of interest, budget, and\nvisa status in determining successful candidacy.\n2. Current employees serving a probationary period are not eligible to\napply.\n3. Currently employed AEFMs who hold a FMA appointment are ineligible to\napply for advertised positions within the first 90 calendar days of\ntheir employment.  \nREMUNERATION:  *Not-Ordinarily Resident: Grade: FP-06 to be confirmed by\nWashington\n*Ordinarily Resident: Position Grade: FSN-8"}, {"name": "International Research & Exchanges Board (IREX)", "location": "NA", "description": "NA", "qualification": "NA"}, {"name": "International Research & Exchanges Board (IREX)", "location": "IREX Armenia Main Office\nDESCRIPTION:   IREX currently seeks to fill the position of non-paid\nfull and part time Administrative Intern. The position is based in the\nYerevan office. This position reports directly to the Administrative\nCoordinator or Program Manager.\nThe internship program serves to:\n- Reinforce and strengthen the interns' personal values and career\nobjectives through an improved understanding of themselves and the work\nenvironment;\n- Assist students in identifying and acquiring the skills needed to\nenter a chosen field;\n- Provide practical work experience to balance the students' theoretical\ntraining;\n- Allow students to meet and learn from professionals in the field and\ndevelop a network of contacts.\nInternship Areas:\nAdministrative Internship\nThe IREX Administrative Internship provides interns with experience in\nthe areas of public relations, secretarial support, translation and\ninterpretation.  Interns will be responsible for greeting visitors,\nresponding to walk in and telephone inquiries about IREX and its\nprograms, directing office communications to appropriate staff, editing\nof written text, assisting with daily administrative tasks such as\nwritten translation, oral interpretation, filing, copying, faxing,\ndrafting correspondence, research, and other duties as needed.\nProgram Internships\nThe IREX Program Internship provides interns with experience working\ndirectly with one or more of IREX's programs including public relations\nand outreach, event coordination, and administrative tasks related to\nspecific programs.  Interns will be responsible for responding to walk\nin and telephone inquiries related to the program, assisting program\nstaff with public outreach campaigns, assisting in the development and\nediting of outreach materials, assisting in event coordination and\nprogram related research, and various administrative tasks including but\nnot limited to written translation, oral interpretation, filing,\ncopying, faxing, and drafting correspondence.  IREX Program Interns are\nassigned to programs according to program needs, technical resources\navailable, and intern skills.  Possible placements include: the\nEducational Information Center (EIC) and Computer Based Testing Center,\nthe Internet Access Training Program (IATP), the Community Connection\nExchange Program, Partnerships and Training Division Education\nCurriculum Development Programs, and the Academic and Exchanges and\nResearch Division Alumni Program.", "description": "NA", "qualification": "NA"}, {"name": "Institute for Sustainable Communities (ISC)", "location": "Tashkent, Uzbekistan Pending funding.", "description": "ISC seeks an experienced and creative Chief of Party\n(COP) to direct a multi-component project in Uzbekistan, Tajikistan and\nKyrgyzstan that will promote organizational strengthening and improve\nthe technical capabilities of water users associations (WUAs) to bring\neconomic and environmental benefits to rural citizens. The COP will\noversee programs that provide grants, technical assistance, and\ninstitutional development training; and a small infrastructure\nimprovements program. Coordination with other USAID project activities\nwill be an important aspect of the project as will the development of\nagricultural-related functions for the WUAs, and will be designed so as\nto maximize agribusiness assistance for WUAs and their members.", "qualification": "- Masters degree with minimum of seven years of senior project\nmanagement experience with nonprofit organizations in an international\nsetting; and three years of experience as chief of party managing not\nless than ten staff persons;\n- Experience with development of water user associations, NGO\nstrengthening programs, and USAID funded projects;\n- Excellent ability to represent the project to donors and partners;\n- Proven ability to direct all aspects of office operations, grant and\ncontract administration, procurement, and financial and personnel\nmanagement;\n- Demonstrated diplomacy, team-orientation management, and ability to\ndevelop and maintain collaborative, team relationships in a fast-paced\nwork environment;\n- Excellent written and oral communications skills, and working\nknowledge of computer word-processing, spreadsheet programs, and e-mail.\nPREFERRED QUALIFICATIONS:  \n- Previous experience in Central Asia and NIS;\n- Knowledge of Russian language is a plus."}, {"name": "Food Security Regional Cooperation and Stability Programme (FRCS)", "location": "Ijevan town, Tavush, Armenia.", "description": "Food Security Regional Cooperation and Stability\nProgramme in South Caucasus (FRCS) is seeking applications for the\nposition of Community Development, Capacity Building and Conflict\nManagement Consultant.", "qualification": "- Higher Education and/or professional experience in economics,\ncommunity development or a related field;\n- Fluent knowledge of the Armenian, Russian and English languages\n(written and oral) is compulsory;\n- Sufficient capabilities in carrying out sector analysis, providing\nconsultancies and drafting documents;\n- Computer skills MS Office 2000 (compulsory);\n- Personal initiative as well as ability and willing to work as a team\nmember;\n- Very good communication skills;\n- Work experience in or with international organizations (preferable);\n-  Ability and willing to work overtime and under time pressure as well\nas frequent travels."}, {"name": "Teleplus LLC", "location": "Yerevan, Armenia", "description": "NA", "qualification": "- Degree in Business Administration or Technological field;\n- Postgraduate degree will be considered as a plus;\n- Previous work experience in a relative position (3-5 years);\n- Perfect command of English and computers;\n- Knowledge of Greek language will be considered a plus;\n- Dynamic and ambitious personality;\n- Managing and organisational skills; \n- Team spirit"}, {"name": "NetCall Communications", "location": "Yerevan, Armenia", "description": "NA", "qualification": "- Excellent knowledge of Windows 2000 Server, Linux platform, Networking\nTCP/ IP technologies, MS SQL 2000 Server;\n- At least 2 years of experience in the proper field;\n- Good knowledge of English."}, {"name": "SOC.Stockholm", "location": "NA", "description": "NA", "qualification": "NA"}, {"name": "United Nations Development Programme, Armenia", "location": "NA", "description": "The United Nations Development Programme in Armenia\nannounces opening for the position of  Country Economist.", "qualification": "- Minimum Masters Degree in Economics;\n- Minimum five years relevant experience at the national level. Some\nexperience in managing development projects and programmes. Extensive\nexperience in research and policy-level analysis;\n- Proven management skills, superior analytical and problem solving\nabilities and strong communication and leadership abilities;\n- Experience in team management;\n- Proficiency in the usage of computers and office software package (MS\nWord, Excel, Power Point and advanced programmes for statistical\nanalysis of data] and competency in the handling of web based management\nsystems;\n- Fluent in English and Armenian. Knowledge of Russian is an asset."}, {"name": "Counterpart International, Inc.\nCounterpart's Community and Humanitarian Assistance Program (CHAP)", "location": "Yerevan, Armenia", "description": "Driver/ Logistics Assistant is a full-time national\nstaff position based in CHAP Yerevan office. Five day work week.", "qualification": "- Possession of personal vehicle, valid driver's license, and proved\n5-year driving experience;\n- Good communication skills;\n- Good organizational skills and diligent attention to details\nassociated with documenting activities to maintain accurate and complete\njob-related records;\n- Good knowledge of logistics and working knowledge of transportation\nsystems.\n- Written and spoken proficiency in Armenian, and Russian.\n- Computer literacy, including knowledge of and experience with word\nprocessors (MS Word), spreadsheets (Excel), databases (MS Access), and\nelectronic mail;\n- Knowledge of, and ability to work with a variety of governmental and\nnon-governmental organizations;\n- Mobility and desire to travel extensively;\n- Willingness to work long or unusual hours/week-ends unexpectedly in\norder to receive and distribute humanitarian supplies and to meet\nprogrammatic goals and objectives;\n- Willingness and ability to work in a smoke-free environment.\nREMUNERATION:  Counterpart International offers competitive salaries and\nbenefits comparable to standards of international NGO community in\nArmenia. Salary is commensurate with experience. Counterpart is an equal\nopportunity organization that strives for diversity and employs\nqualified personnel without regard to gender, race, physical disability,\nreligion, or ethnicity."}, {"name": "Xalt LLC", "location": "Yerevan, Armenia", "description": "The position of Graphic Designer (GD) demands a\nproven, successful experience in the field of \"new media\". The design\nand communication concepts that you have created since completing your\nstudies are proving to be popular.", "qualification": "As a GD you are creative, innovative and have\na great capacity to implement your stylish ideas, open to new trends and\nfine arts.\n- Extensive knowledge of graphic design and marketing communications\ntools is required as well as thorough knowledge of Adobe Photoshop and\nAdobe Illustrator and at least 2 years experience working in web and\npublishing;\n- Enough knowledge of Macromedia Freehand, Fireworks and Dreamweaver and\nfamiliarity with complex web developments, G.U.I. standards, web\neditors, animations in 3D is a plus.\n- You are reliable, responsible and have excellent communications\nskills. \nPREFERRED QUALIFICATIONS: \n- English Essential - verbal/ written / understanding;\n- Experience as Graphic Designer in a creative environment is an asset;\n- Organized, methodical, \"out of the box\" thinker and goal-oriented;\n- Willing to learn new skills."}, {"name": "CUTS Centre for International Trade, Economics and Environment", "location": "London, UK", "description": "This is an excellent opportunity for the right person\nto join CUTS Centre for International Trade, Economics and Environment,\nLondon. CUTS (Consumer Unity & Trust Society) is a charitable\norganisation, with its headquarters in Jaipur, India, working at the\nlocal, national, regional and international levels, and has recently\nopened an office in London. The London office will coordinate and manage\nresearch and advocacy work on trade and economic issues and will also\nsupport other offices of CUTS by raising funds, organising events, etc.\nThe organisation is concerned with the impact of international trade and\neconomic regime on developing countries and advocates for the poor at\ndifferent levels. The position will involve providing support for all\nthese activities. Applicants must have experience in office\nadministration.", "qualification": "- Fluency in spoken and written English; knowledge of other European\nlanguages will be desirable;\n- Wide-ranging administrative skills (knowledge of\naccounting/bookkeeping work, knowledge of tax, social security and\naccounting maters as per the British law, IT skills, etc);\n- Ability to prioritise competing tasks, even under pressure, in a\nmethodical and systematic manner;\n- Experience in working using her/his own initiative as well as working\nin a team;\n- Excellent inter-personal and communication skills;\n- Excellent organising skills, including event organisation;\n- An international outlook and interest in developmental issues;\n- Comfortable in dealing with high-level dignitaries and working in an\ninternational environment. \nREMUNERATION:  18,000 per annum."}, {"name": "Yerevan Brandy Company", "location": "Yerevan, Armenia", "description": "NA", "qualification": "- University degree in Jurisprudence;\n- Experience in the following fields: commercial transactions, sales\ncontracts, property right;\n- Knowledge of tax and labor legislations, laws on trademarks and\neconomic competition;\n- Excellent knowledge of Armenian, Russian and English languages;\n- Knowledge of MS Office.\nREMUNERATION:  Will be commensurate with the norms accepted in the\ncompany."}, {"name": "ACDI/VOCA", "location": "Tbilisi, Georgia", "description": "The Marketing Advisor will lead the project in\nidentifying and developing market opportunities, helping to develop\nGeorgian capacity to structure deals, nurture the commercial skills of\nexisting entrepreneurs, attract investment partners and facilitate\nincreased agribusiness activities. The Marketing Advisor will be based\nin Tbilisi, Georgia with extensive travel throughout Georgia and the\nsurrounding region.", "qualification": "- 10+ years of actual commercial marketing experience with fresh and\nprocessed food products; 2+ years of this experience in Russia and other\nformer Soviet Union states;\n- Actual commercial experience in identifying and assessing market\nopportunities and in formulating successful marketing and market chain\ndevelopment strategies;\n- Experience in conducting pre-feasibility and feasibility level\ninvestigations, and in business planning;\n- Track record in conceptualizing and structuring commercial ideals;\n- Extensive network/existing relationships with commercial buyers and\nsellers of fresh and processed food products;\n- Network of potential strategic partners for commercial agribusiness\nventures;\n- Experience in designing/implementing market information type services;\n- University degree in marketing, agriculture, business management or\nequivalent practical experience;\n- High level of English and preferably some Russian;\n- Good communication skills and able to work and travel in various\nsettings;\n- Of paramount importance is ability to function as part of a team;\n- Good computer skills in Windows, Word, Excel, and in the use of\ninformation management databases."}, {"name": "Armenia TV", "location": "Yerevan, Armenia", "description": "The candidate will work for the promotion and\ndevelopment of the company's activities. The Supervisor will also work\nin close collaboration with special departments and be responsible for\ntheir monitoring. The candidate will supervise and organize programs,\ndevelop work plans and perform other duties project requires.", "qualification": "- Experience in one or more of the following areas: art design, film\nproduction, TV and/or radio program production is a must;\n- Strong project leadership/ management experience with a multi-skilled\nteam; \n- Work experience with international agencies/companies, at least one\nyear; \n- Master's degree (MA), Master of Art in Film production (or similar\narea) preferred;\n- Analytical and organizational skills, strong communication and public\nspeaking skills;\n- Advanced MS Office and Internet user; other computer skills are an\nadvantage; \n- Bilingual Armenia and Russian, English - fluent, are a must,\nadditional knowledge of French preferred. \nPREFERRED QUALIFICATIONS:  \n- Demonstrated strong personal management and inter-personal skills and\nproven ability to train, mobilize and direct staff; \n- Experience in fundamental project management skills around project\nplanning, project controlling, estimating, staffing and project budget\nmanagement;\n- Must have solid experience and skills in the technical aspects; \n- Effective management, leadership and team interaction skills,\nincluding the ability to plan and organize work for others, to make\nformal and informal presentations, and to communicate effectively at\nmultiple levels; \n- Must be self-directed and have a track record of meeting project\ndeadlines; \n- Strong consulting skills as well as previous consulting experience is\npreferred."}, {"name": "Media Diversity Institute", "location": "Yerevan, Armenia", "description": "Media Diversity Institute (MDI) is looking for an\nexperienced Journalism Trainer from Armenia to participate as a\nco-trainer in a three-day workshop for journalists on diversity\nreporting.\nThe training programme has been developed by Media Diversity Institute.\nThe workshop will focus on the full and objective coverage of both the\nmajority and minorities - using both international and local examples\nand trainers. Workshop sessions, using a mixture of theory and practical\nexercises, will focus on the way the media covers diversity issues, and\nhow it could improve that coverage.\nTraining will be conducted from February 16 to February 18 in Yerevan.\nAll the costs related to participation are covered by organizers of the\nevent.", "qualification": "The trainer should have a very strong\nbackground in journalism training and reporting and have a good command\nof English."}, {"name": "Armenia School Connectivity Program", "location": "Yerevan, Armenia", "description": "Project Harmony, an innovative, not-for-profit\nprofessional exchange and training organization with 13 offices across\nthe US, Armenia, Azerbaijan, Georgia, Russia and Ukraine currently seeks\nan experienced, mature professional to fill the position of Deputy\nProgram Director for the Armenia School Connectivity Program (ASCP), a\nprogram of the Bureau of Educational and Cultural Affairs of the US\nDept. of State administered by Project Harmony. This position is based\nin Yerevan, Armenia with extensive regional travel. Fluency in Russian\nand/or Armenian is essential. Project Harmony seeks to fill this\nposition as soon as possible.  Project Harmony is an equal opportunity\nemployer, which provides its staff opportunities for job growth,\ninnovation, and creativity.", "qualification": "- Proven leadership and ability to manage a multi-national staff;\n- Flexibility and grace under the demands of changing tasks;\n- Excellent organizational and accounting skills;\n- Cultural sensitivity and willingness to adjust to demanding work\nschedule; \n- Ability to work in a team and communicate effectively; \n- Ability to work independently; \n- Experience living and working in Eurasia; \n- Fluency in written and spoken Russian and/or Armenian; \n- Familiarity with Internet infrastructure and telecommunications issues\nin the Caucasus a plus; \n- US citizen.\nREMUNERATION:  Benefits include salary commensurate with experience,\nhealth insurance, and international travel expenses."}, {"name": "Yerevan State University (YSU) and Civic Education Project (CEP)", "location": "NA", "description": "NA", "qualification": "NA"}, {"name": "Media Diversity Institute", "location": "Yerevan, Armenia", "description": "Media Diversity Institute (MDI) is looking for an\nexperienced journalism trainer from Armenia to participate as a\nco-trainer in a three-day workshop for journalists on diversity\nreporting.\nThe workshop, which will be held on 16-18 February in Yerevan will focus\non the full and objective coverage of both the majority and minorities -\nusing both international and local examples and trainers. Workshop\nsessions, using a mixture of theory and practical exercises, will focus\non the way the media covers diversity issues, and how it could improve\nthat coverage.", "qualification": "The trainer should have a very strong\nbackground in journalism training and reporting and have a good command\nof English."}, {"name": "Media Diversity Institute", "location": "Yerevan, Armenia\nDESCRIPTION:   Media Diversity Institute (MDI) accepts applications from\njournalists for participation in a three-day workshop for journalists\ncovering diversity reporting.\nThe workshop will focus on the full and objective coverage of both the\nmajority and minorities - using both international and local examples\nand trainers. Workshop sessions, using a mixture of theory and practical\nexercises, will focus on the way the media covers diversity issues, and\nhow it could improve that coverage.\nJournalists who currently work for mainstream media in Armenia and write\non or are interested in developing their writing on issues related to\ndiversity (ethnic minorities, religion, disability, marginalized and\nsocially disadvantaged groups etc) are eligible to apply.  MDI\nencourages applicants from the regions to apply for the workshop.\nThe training programme has been developed by Media Diversity Institute.\nTraining will be conducted from February 16 to February 18 in Yerevan. \nAll the costs related to participation are covered by organizers of the\nevent.", "description": "NA", "qualification": "NA"}, {"name": "SEF International", "location": "Yerevan, Armenia", "description": "Senior Management Position in Micro-Finance \nSEF International, a growing universal credit organization with an\n8-year of experience in Armenia, advertises a position of a Chief\nAccountant based in Yerevan. This position will provide leadership in\ndevelopment and implementation of financial policies in the areas of\nbudgeting, cash management and forecasting, recordings and\ndocumentation, auditing and financial reporting.", "qualification": "- University degree in Finance or Accounting;\n- At least 5 years of relevant experience in a micro-finance field; \n- At least 2 years of managing, supervising and training of personnel;\n- CBA license for Chief Accountant or Deputy Chief Accountant position; \n- Proven knowledge of Generally Accepted Accounting Principles, and\nInternational and Armenian Accountant Standards; \n- Ability to administer financial and internal control systems;\n- Comprehension of data processing concepts and structures; \n- Strategic management of business forecast and analysis, planning and\nmonitoring of budgets; \n- Familiarity with grant management; \n- Computer literacy and working knowledge of word processor and\nspreadsheet applications; \n- Knowledge of Sun Systems and eMerge is preferred; \n- Team building skills, and ability to work with multi-national staff; \n- Willingness to travel to the branches across Armenia; \n- Strong verbal and written communication skills in Armenian, English\nand Russian."}, {"name": "International Relief and Development (IRD)", "location": "Yerevan, Armenia", "description": "International Relief and Development (IRD) Armenia\nBranch urgently seeks a qualified individual to fill in a short-term\nposition of a Consultant to conduct a feasibility study in an\nagricultural sector.", "qualification": "NA"}, {"name": "American Embassy Yerevan\nANNOUNCEMENT NUMBER: 04-03", "location": "NA", "description": "Performs guard duties on a regular basis at either a\nstationary or working patrol post at/around the Embassy Yerevan New\nOffice Building. Controls access to avoid unauthorized individuals and\nvehicles from entering the construction site and authorized limits as\nset by the OBO Site Security Manager. Remains alert to his/her\nsurroundings for any unusual activity or suspicious behavior.\nA copy of the complete position description listing all duties and\nresponsibilities is available in the Human Resources Office. Contact\nnumber: (3741) 52-46-61", "qualification": "NOTE: All applicants are instructed to\naddress each selection criterion detailed below with specific and\ncomprehensive information supporting each criteria.\n- High school education is required;\n- Level II (limited knowledge) in English. Fluency in Armenian and good\nworking knowledge in Russian is required;\n- Knowledge of basic guard and security related procedures and\npractices;\n- Ability to work calmly and tactfully to resolve problems/ situations\nrelated to security. Ability to remain alert to the surroundings, detect\npossible treat and prevent hostile activity from occurring. \nSELECTION PROCESS:   When equally qualified, Eligible Family Members and\nU.S. Veterans will be given preference. Therefore, it is essential that\nall candidates address the required qualifications above in the\napplication. \nADDITIONAL SELECTION CRITERIA: \n1. Management will consider nepotism/ conflict of interest, budget, and\nvisa status in determining successful candidacy.\n2. Current employees serving a probationary period are not eligible to\napply.\n3. Currently employed AEFMs who hold a FMA appointment are ineligible to\napply for advertised positions within the first 90 calendar days of\ntheir employment.  \nREMUNERATION:  *EFM/MOH/NOR: Position Grade: FP-CC to be confirmed by\nWashington\n*Ordinarily Resident: Position Grade: FSN-2"}, {"name": "UMCOR Armenia", "location": "NA", "description": "The United Methodist Committee on Relief (UMCOR)\nArmenia is seeking applicants for the position of Training Officer for\n\"Prevention and Control of HIV/AIDS and STIs\" Project implemented in\nGegharkunik marz. The goal of the project is to reduce the risk of\nHIV/AIDS, STIs and TB among rural communities by promoting behavioural\nchanges and strengthening the health care system's management of STIs.", "qualification": "- Graduate Degree in Medicine;\n- Experience in developing health education training materials on\nHIV/AIDS and Tuberculosis;\n- Experience in conducting training especially for community groups;\n- Highly developed sense of responsibility, excellent organizational\nskills, attentive to details;\n- Ability to travel and conduct training in the region;\n- Working experience with International Governmental/ Non-governmental\nOrganizations;\n- Fluent Armenian, working knowledge of English and Russian;\n- Computer literate."}, {"name": "American Embassy Yerevan\nANNOUNCEMENT NUMBER: 04-04", "location": "NA", "description": "Drives a passenger vehicle for U.S. Mission\nemployees, official visitors and for delivering official correspondence,\ngratuities and other items within the city and surrounding area\naccording to Dispatcher's instructions. Assures passenger compliance\nwith USG safety regulations.\nA copy of the complete position description listing all duties and\nresponsibilities is available in the Human Resources Office. Contact\nnumber: (3741) 52-46-61", "qualification": "NOTE: All applicants are instructed to\naddress each selection criterion detailed below with specific and\ncomprehensive information supporting each criteria.\n- Completion of elementary school is required;\n- One year of experience as a driver;\n- Level III (good working knowledge) English. Fluency in Armenian;\n- Knowledge of basic guard and security related procedures and\npractices;\n- Must have good knowledge of automotive vehicle operation and safety\nand general knowledge of automotive maintenance;\n- Must have valid driver license (BC) and be familiar with all traffic\npatterns of area.  \nSELECTION PROCESS:   When equally qualified, Eligible Family Members and\nU.S. Veterans will be given preference. Therefore, it is essential that\nall candidates address the required qualifications above in the\napplication. \nADDITIONAL SELECTION CRITERIA: \n1. Management will consider nepotism/ conflict of interest, budget, and\nvisa status in determining successful candidacy.\n2. Current employees serving a probationary period are not eligible to\napply.\n3. Currently employed AEFMs who hold a FMA appointment are ineligible to\napply for advertised positions within the first 90 calendar days of\ntheir employment.  \nREMUNERATION:  *EFM/MOH/NOR: Position Grade: FP-BB to be confirmed by\nWashington\n*Ordinarily Resident: Position Grade: FSN-3"}, {"name": "Caucasus Research Resource Center - Armenia", "location": "Yerevan, Armenia\nDESCRIPTION:   Demographic analysis and population projection represent\none of the cornerstones of public sector planning and private sector\nmarket analysis at the national, regional, and local levels. Population\nprojections also provide the crucial denominator data needed for health\nprograms monitoring and evaluation. This workshop will strengthen the\nparticipant's capacity: \n- to evaluate census, survey, and vital statistics data; \n- produce a consistent set of demographic estimates; \n- prepare national population projections for planning, monitoring, and\nevaluation. \nThe workshop will focus on the analysis of data from the 2001 census,\nthe 2000 Demographic and Health Survey (DHS), vital statistics, and\nother administrative data. However, special attention will be given to\nthe census and DHS data in order to maximize the timeliness and utility\nof analytical products based on these data sources. Approximately two\ndays will be devoted to developing a design and outline for a 2001\ncensus analytical report or series of reports. \nParticipants will use the same U.S. Census Bureau and United Nations\ndemographic analysis and projection software used by staff of the Census\nBureau's International Programs Center to prepare estimates and\nprojections for the countries of Western Asia, including Armenia.", "description": "NA", "qualification": "Participants should be mid-level professionals\n(Statisticians and Demographers) who would directly use official census\nand demographic survey data in their day-to-day work. This workshop\nwould be most beneficial for those who make or use population\nprojections. Participants should have a university degree and be\ncomputer-literate, using PCs on a daily basis in a Windows environment.\nEnglish language is helpful, but not required. \nIndividuals from government, private, and academic institutions are\nsought. Participants from ministries such as Education, Health, or other\nministries that depend on demographic data are encouraged to apply.\nIndividuals from mass media or NGOs (unless specifically interested in\ndemography), would not be appropriate for this course. \nCOURSE OVERVIEW:  This workshop will be taught by demographers from the\nUnited States Census Bureau. The course will be taught in English, with\nconsecutive translation provided in Armenian. The course is offered free\nto qualified candidates. No housing, travel, or per diem allowances are\navailable. \nThis is a three-week course, starting March 9th and finishing on the\n26th. Classes will be held Tuesday through Saturday, except for the last\nand final week, when classes will be held Tuesday through Friday. A\none-hour break will be given for lunch, with coffee breaks during the\nday as appropriate. Potential candidates must be able to make the\nthree-week commitment that this course requires-absences for more than a\nday would not be acceptable."}, {"name": "CIT Ltd.", "location": "Yerevan, Armenia", "description": "NA", "qualification": "- Work experience of at least two years; \n- Knowledge of Visual Studio .NET.\nREMUNERATION:  Depends on skills and previous experience."}, {"name": "Synergy International Systems, Inc./Armenia", "location": "Yerevan, Armenia", "description": "Synergy International Systems, Inc./Armenia is\ncurrently seeking self-motivated individuals to join our quality\nassurance team. The ideal candidate will meet the following basic\nrequirements:", "qualification": "- Degree in Computer Science, Information Technology or related\ndiscipline (Bachelor's Degree in the relevant field required, Master's\nDegree preferred);\n- Good knowledge of SQL script;\n- Knowledge of SQL Database;\n- Understanding of software life cycle;\n- Ability to work under pressure and in multi-task environment;\n- Ability to work in a team while being self-directed and highly\nmotivated;\n- Good command of English.\nAdditional Characteristics:\n- Knowledge of one of programming languages (C++/ Visual C++; VB; Java);\n- Previous working experience with automating scripts programs such as\nVisual Test and Win Runner;\n- Knowledge of HTML/XML, ASP/PHP;\n- Excellent analytical and problem-solving skills and attention to\ndetail;\n- Excellent interpersonal and organizational skills."}, {"name": "AMERIA CJSC", "location": "Yerevan, Armenia", "description": "AMERIA Closed Joint Stock Company is seeking a\nReceptionist to provide secretarial and administrative support to the\noffice.", "qualification": "- University degree is desirable;\n- Excellent oral and writing skills in Armenian, Russian and English;\n- Excellent knowledge of computer applications (MS Windows, MS Office,\ngraphics and spreadsheet software packages);\n- Working experience in similar position. Previous working experience in\ninternational organizations is strongly desirable."}, {"name": "Internationale Journalisten Programme (IJP), Germany", "location": "NA", "description": "NA", "qualification": "NA"}, {"name": "Armenian Red Cross Society", "location": "Yerevan, Armenia\nDESCRIPTION:   Administrative Support to the International Affairs\nDepartment. This is a non-paid position. After completion a letter of\nreference will be available for successful Volunteers/ Interns.\nRESPONSIBILITIES:  \n- Assist in maintaining general office correspondence;\n- Provide translations from English into Armenian and vice versa;\n- Typing and formatting a variety of materials, filing.", "description": "NA", "qualification": "- Students studying in linguistics field (Yerevan State University or\nInstitute after Valery Bryusov) are encouraged to apply;\n-Excellent knwoledge of English and Armenian (written and oral)."}, {"name": "Mercy Corps", "location": "Central Asia", "description": "Mercy Corps is currently looking for an experienced\nTeam Leader/ Chief of Party to help us leverage our strong presence in\nthe Communities of Central Asia to help address the continuous challenge\nof water use and legislative reform on the region. The Team Leader will\nwork with existing Mercy Corps staff and our partners to manage the\nimplementation of a five year USAID funded project to advance community\nwater management and irrigation practices through development of Water\nUsers' Associations, the Team Leader will provide the vision and\nleadership to ensure that the project is planned and executed with\nquality, accountability, and measurable impact.", "qualification": "- Seven to ten years of field experience in leading and starting up\nlarge international relief and development programs, with significant\nexperience managing multi-million dollar USAID funds;\n- Experience in irrigation and water management in Central Asia or other\nformer Soviet Union countries;\n- Experience with local NGO partner development and capacity building\nprograms;\n- Demonstrated ability and experience in leading effective policy level/\nlegal development initiatives, preferably in the field of water users'\nassociations or resource management.\nREMUNERATION:  Mercy Corps offers a competitive benefits package, strong\nimplementation support and an excellent working culture."}, {"name": "Mercy Corps", "location": "Bam, Iran", "description": "We are currently seeking a Program Manager to oversee\nMercy Corps community-driven programs addressing the psychosocial needs\nof children affected by the earthquake. These programs are intended to\nempower communities to prioritize, plan and implement projects that\naddress the psychosocial needs of children affected by the earthquake.", "qualification": "- A BA/S or equivalent (MA/S preferred) in Child Psychology or related\nfield;\n- Three years international experience working in psychosocial program\nmanagement (including psychosocial assessment) and administration, three\nyears international experience implementing an integrated community\ndevelopment project and one year experience working with an NGO in\nadministering small grants and ensuring compliance with donor\nregulations and project objectives;\n- Proficiency in English essential;\n- Proficiency in Farsi is preferred, but not required."}, {"name": "AMERIA CJSC", "location": "Yerevan, Armenia", "description": "AMERIA Closed Joint Stock Company is seeking a\nReceptionist to provide secretarial and administrative support to the\noffice.", "qualification": "- University degree is desirable;\n- Excellent oral and writing skills in Armenian, Russian and English;\n- Excellent knowledge of computer applications (MS Windows, MS Office,\ngraphics and spreadsheet software packages);\n- Working experience in similar position. Previous working experience in\ninternational organizations is strongly desirable."}, {"name": "Development Alternatives, Inc.", "location": "Ghana", "description": "DAI is seeking candidates for long-term resident\nposition(s) in the field of agribusiness for an upcoming USAID-funded\nagribusiness development program in Ghana. Candidates should have hands\non experience in Agribusiness from production to marketing, as well as\nthe proven ability to locate markets and establish linkages with\nproducers/ exporters.\nSpecific Areas of Expertise Sought:\n- Tropical agricultural production (especially high-value horticulture)\nfor export, including sanitary and phytosanitary requirements and\nbroader certification approaches such as EUREP-GAP;\n- Agribusiness Development;\n- Agribusiness marketing; Export Promotion; proven ability to \"make\ndeals\" and move product;\n- Post-harvest handling; Food processing;\n- Producer association development;\n- Horticultural and specialty export crops;\n- Market information systems; International trade; and\n- Agricultural finance and investment promotion.", "qualification": "- Educational background in business or agriculture;\n- Minimum 10 years of experience in agribusiness with the focus on\nmarketing;\n- Work experience in international or prominent Agribusiness companies;\n- Regional experience in West Africa, preferably Ghana, or appropriate\nother Africa experience (E.g. Kenya, Uganda); as well as thorough\nknowledge of European markets and standards; and\n- Experience in developing market linkages for domestic, regional, and\ninternational markets in Africa;\n- Previous long-term experience implementing agricultural and\nagribusiness development activities on USAID-funded projects. \nREMUNERATION:  Level of responsibility and salary commensurate with\nbackground and experience."}, {"name": "Initiatives Inc.", "location": "Middle East", "description": "Initiatives Inc. seeks a Quality Assurance/ Health\nSystems Management Advisor for a multi-year assignment.", "qualification": "- MD or DrPH and experience/ qualifications in public health, health\nsystems management, HR management and quality assurance;\n- 7-10 years field experience;\n- A minimum of 5 years of experience working in quality assurance\n.Strong leadership skills;\n- Experience in large and complex programs;\n- Professional proficiency in the English language (verbal and written);\n- Excellent communication skills;\n- Strong organizational skills and attention to detail;\n- Ability to work in a team;\n- Must be proficient in MS Word and Excel.\nPREFERRED QUALIFICATIONS:  \n- Experience with USAID or other large international donors;\n- Experience working in cross-cultural environments;\n- Work experience in the Middle East;\n- Professional proficiency in Arabic."}, {"name": "Military Institute", "location": "Yerevan, Armenia", "description": "Military Institute is looking for a Teacher of\nInformation Technologies.", "qualification": "- University degree;\n- Working experience of at least 3 years; \n- Knowledge of Windows, Ms-Office, programming (V. Basic).\nREMUNERATION:  40 - 45000 drams"}, {"name": "Microenterprise Development Fund Kamurj", "location": "Vanadzor, Armenia", "description": "MDF Kamurj is currently looking to recruit a Cashier\nfor its Vanadzor branch. The Cashier will do bank transactions, accept\nloan repayments, disburse loans in Vanadzor branch and it's program\nareas. S/he will maintain cash flow according to existing policy and\nprocedures.", "qualification": "- Minimum 1 year cashier experience;\n- Excellent communication and interpersonal skills;\n- Ability to work as a team member;\n- Excellent knowledge of Armenian language;\n- Experience in working with computers is desirable."}, {"name": "International Relief and Development (IRD)", "location": "Yerevan, Armenia", "description": "International Relief and Development (IRD) Armenia\nBranch seeks a qualified individual to fill in a position of a Medical\nMonitor to monitor the implementation of Essential Medical Commodities\nDistribution Program.", "qualification": "- Medical background and at least 2 years of experience as a medical\ndoctor are required. \n- Working knowledge of English and computer skills (MS Word and Excel).\n- Flexible for extensive travel to marzes.\n- Experience with International NGOs will be an asset.\n- Excellent analytical and organization skills. Ability to think\ncritically and creatively.\n- Excellent interpersonal skills, including patience, diplomacy,\nwillingness to listen and respect colleagues. Must be capable for\nworking both individually and as a part of a team.\n- Ability to work effectively in fast-paces, stressful environment. Must\nbe flexible and willing to perform other duties and work irregular\nhours."}, {"name": "American Embassy Yerevan\nANNOUNCEMENT NUMBER: 04-06", "location": "NA", "description": "Provides Telephone operator/ receptionist service to\nall sections of the U.S. Embassy in Yerevan. Operates the Embassy Base\nStation radio, assists with vehicle dispatch duties after normal Embassy\nduty hours. Operates the Embassy facsimile machine. Periodically assists\nin the mail Room or as the IRM Secretary.\nA copy of the complete position description listing all duties and\nresponsibilities is available in the Human Resources Office. Contact\nnumber: (3741) 52-46-61", "qualification": "NOTE: All applicants are instructed to\naddress each selection criterion detailed below with specific and\ncomprehensive information supporting each criteria.\n- Completion of high school is required;\n- Two years experience as a Telephone Operator or Receptionist is\nrequired;\n- Level III (good working knowledge) English. Fluency in Armenian;\n- Must be skilled in using a tactful and diplomatic manner when dealing\nwith all levels of Embassy personnel;\n- Must be able to work unusual work hours, to include shift work.\nSELECTION PROCESS:   When equally qualified, Eligible Family Members and\nU.S. Veterans will be given preference. Therefore, it is essential that\nall candidates address the required qualifications above in the\napplication. \nADDITIONAL SELECTION CRITERIA: \n1. Management will consider nepotism/ conflict of interest, budget, and\nvisa status in determining successful candidacy.\n2. Current employees serving a probationary period are not eligible to\napply.\n3. Currently employed AEFMs who hold a FMA appointment are ineligible to\napply for advertised positions within the first 90 calendar days of\ntheir employment.  \nREMUNERATION:  *EFM/MOH/NOR: Position Grade: FP-AA to be confirmed by\nWashington\n*Ordinarily Resident: Position Grade: FSN-4"}, {"name": "International Registered Nurses of America, Inc.", "location": "Yerevan, Armenia", "description": "We are looking for dynamic and creative ESL/ TOEFL/\nTWE/ TSE instructors willing  to teach written and spoken English to\nArmenian nurses and help them master TOEFL/ TWE/ TSE exam taking skills.", "qualification": "Ideal candidates will  have lived or studied\nin the United States or in another English speaking  country for at\nleast four years. Individuals who have scored 600 or above on the TOEFL\nexam (or 250 on the computerized TOEFL) will be considered as well.\nREMUNERATION:  Negotiable"}, {"name": "Armenian Caritas", "location": "Gyumri, Shirak Region, permanent residence is not\nrequired", "description": "Armenian Caritas is seeking an experienced Programs\nManager to lead the development of programs and coordinate the design,\ndocumentation, monitoring, and evaluation of program activities for the\npurpose of assuring the ongoing quality. He/she will be fully aware of\nall aspects of all projects and will provide leadership and guidance to\nthe program team (Project Managers and Project Staff).", "qualification": "- At least five years of practical experience in relevant field;\n- Experience in program monitoring and evaluation;\n- Ability to work in a team structure and operate efficiently;\n- Excellent leadership and decision-making skills;\n- Experience in writing proposals, project documentation, reporting and\nprogram information for donors;\n- Excellent verbal and written communication skills in both English and\nArmenian languages;\n- Excellent computer skills including Internet usage;\n- Excellent interpersonal, communication and co-operation skills."}, {"name": "Armenian Caritas", "location": "Gyumri, Shirak Region, permanent residence is not\nrequired", "description": "Armenian Caritas seeks to hire a full-time Proposal\nWriter to develop and design the new projects and help the organization\nto achieve its strategic goals.", "qualification": "- Five years related work experience, preferably in the fields of\ncommunity development; \n- University Diploma; \n- Knowledge of principles, problems and methods of grant proposal\nwriting; \n- Strong analytical, writing, and verbal skills in both English and\nArmenian languages;\n- Training in grant writing; \n- Excellent computer skills including Internet usage; \n- Excellent interpersonal, communication and co-operation skills."}, {"name": "International Registered Nurses of America, Inc.", "location": "Yerevan, Armenia", "description": "We are looking for volunteers, who are fluent in\nconversational English, to help Armenian nurses to learn standard\nAmerican spoken English. \nREMUNERATION:  Negotiable", "qualification": "NA"}, {"name": "SEF International Universal Credit Organisation Ltd.", "location": "Sisian, Armenia", "description": "SEF International, a growing universal credit\norganization in Armenia, is looking to recruit qualified and experienced\nAccountant for its Sisian branch. This position will carry out routine\naccounting and financial reporting for the branch as well as handling\ncredit-related information.", "qualification": "- University degree or respected certificate in Finance or Accounting;\n- At least three years of relevant experience in micro-finance or\nbanking field;\n- At least two years of relevant experience in reporting to tax\nauthorities;\n- Proven knowledge of Generally Accepted Accounting Principles,\nInternational and Armenian Accounting Standards;\n- Ability to financial data processing;\n- Skills in fiscal reporting, ability to resolve taxation issues;\n- Practical knowledge of financial systems and internal controls in\nArmenia;\n- Analytical skills and good attention to details;\n- Computer literacy and working knowledge of word processor and\nspreadsheet applications; knowledge of Sun Systems is preferred;\n- Ability to work in a team and with multi-national staff;\n- Verbal and written communication skills in Armenian, professional\nproficiency in English and Russian;"}, {"name": "Training and Development Ltd.", "location": "Yerevan and different marzes of RA", "description": "T&D is looking for Trainers/ Consultants and\nModerators/ Facilitators in business and management spheres with\ncomprehensive experience in the related fields for further cooperation\nwith them.\nRESPONSIBILITIES:  Provides instructional, facilitation and consultation\nservices for \"Training & Development\" clients.", "qualification": "- Training experience;\n- Relevant education in business and management field;\n- Ability to work with people and prepare rapports."}, {"name": "Armenia TV", "location": "Yerevan, Armenia", "description": "The candidate will work for the promotion and\ndevelopment of the company's activities. The Supervisor will also work\nin close collaboration with special departments and be responsible for\ntheir monitoring. The candidate will supervise and organize programs,\ndevelop work plans and perform other duties project requires.", "qualification": "- Experience in one or more of the following areas: art design, film\nproduction, TV and/or radio program production;\n- Strong project leadership/ management experience with a multi-skilled\nteam;\n- At least one year working experience with international agencies/\ncompanies;\n- Master's degree (MA), Master of Art in Film production (or similar\narea) preferred;\n- Analytical and organizational skills, strong communication and public\nspeaking skills;\n- Advanced MS Office and Internet user; other computer skills are an\nadvantage; \n- Bilingual knowledge of Armenian and Russian languages, English -\nfluent, are a must, additional knowledge of French is preferred.\nPREFERRED QUALIFICATIONS:  \n- Demonstrated strong personal management and inter-personal skills and\nproven ability to train, mobilize and direct staff;\n- Experience in fundamental project management skills around project\nplanning, project controlling, estimating, staffing and project budget\nmanagement;\n- Must have solid experience and skills in the technical aspects; \n- Effective management, leadership and team interaction skills,\nincluding the ability to plan and organize work for others, to make\nformal and informal presentations, and to communicate effectively at\nmultiple levels;\n- Must be self-directed and have a track record of meeting project\ndeadlines;\n- Strong consulting skills as well as previous consulting experience."}, {"name": "ARQELL CJSC", "location": "Kotaik region, Armenia", "description": "We are seeking a Manufacturing Chief, a professional\nwho has diverse experience in all aspects of manufacturing of\nmechanical, electromechanical and electrical equipment. He will be\nresponsible for all the processes the raw material will go through,\nuntil it is converted to finished products. He will also be responsible\nfor keeping the manufacturing equipment maintained, in order to secure\nthe quantity and quality of what is manufactured. He will report\ndirectly to the Executive Director.", "qualification": "- Degree in Mechanical Engineering or related Engineering fields;\n- Fifteen years minimum experience managing component and equipment\nmanufacturing in a modern manufacturing environment;\n- Ability to work as a member of a team where he has to interact with\nmany departments in the firm;\n- Computer literate with Intermediate user understanding of Microsoft\noffice Suite and AutoCAD programs;\n- Fluent in English, Russian and Armenian languages;\n- Must have good communication skills, verbal and written;\n- Knowledge of Tool and Die work, Precision sheet metal work and\nInjection molding work would be a plus.\nREMUNERATION:  Salary-500 USD to 1000 USD, equal to AMD per month."}, {"name": "IntraHealth International/ PRIME II Project", "location": "Lori Marz and Yerevan, Armenia", "description": "IntraHealth International/ Prime II project in\nArmenia is seeking a driver to work in Lori Marz and Yerevan offices.", "qualification": "- University degree; driver's valid license (B, C);\n- Five years work experience as a driver with international\norganizations;\n- Working knowledge of English and Russian, very good knowledge of\nArmenian;\n- High sense of responsibility and alertness;\n- Good knowledge of the area and current condition of roads and\nhighways;\n- Tact and ability to work effectively with people;\n- Ability to work in the evenings when necessary;\n- Technical understanding of the vehicle in order to take care of its\nday-to-day maintenance, arrange and supervise repair works;\n- The applicant should have permanent residence in Yerevan and Lori Marz\n(Vanadzor);\n- Health status: good;\n- Age: 30 - 50."}, {"name": "Teleplus LLC", "location": "Yerevan, Armenia", "description": "Teleplus LLC is looking for a General Manager.", "qualification": "- Degree in Business Administration or Technological field;\n- Postgraduate degree will be considered as a plus;\n- Previous work experience in a relevant position;\n- Perfect command of English and computers;\n- Knowledge of Greek language will be considered as a plus;\n- Dynamic and ambitious personality;\n- Managing and organizing skills;\n- Team spirit."}, {"name": "PLS RAMBOLL Management", "location": "The location is in Tashkent in the Republic of\nUzbekistan, and a minimum percentage of expertise working time to be\nspent in the Republic of Uzbekistan is 90% for the project duration.", "description": "PLS RAMBOLL Management is looking for Experts for\n\"Further deepening of democratic reforms in Uzbekistan\"- EU Tacis funded\nproject. The team of experts will work with the Chairman of the Oliy\nMajlis Committee on Legislation and Judiciary and a broad range of other\nbeneficiaries to the project including among many others the Oliy Majlis\nSecretariat and Committees on Press and Information, Reforming Economy\nand Entrepreneurship and Social Issues and Employment. The project\nshould also provide technical assistance and policy advice to establish\na system and joint procedures and interaction mechanisms between the\nOliy Majlis, the Constitutional Court and the Supreme Court of\nUzbekistan.", "qualification": "- A team leader (minimal input: 396 working days);\n- Minimum 10 years of expertise in legal and administrative reform,\npreferably in Central and East European Countries (CEECs) or Central\nAsian countries;\n- University degree, preferably in Law, Economics, Political Science or\nPublic Administration and relevant professional experience in\napplication of qualifications;\n- Strong proven project management capabilities and proven ability in\nliaising successfully with institutions in transition countries;\n- Professional experience of managing international, multi-disciplinary\nteams of specialists, preferably in NIS or Eastern Europe countries;\n- Excellent communication skills;\n- Fluent in written and spoken English;\n- Knowledge of Uzbek/ Russian would be an advantage.\nWe have also vacant positions for short-term Experts and they must have:\n- Minimum of 5 years of expertise as long-term or short-term expert in\nthe legal and administrative reform processes, preferably in settings\nsimilar to Uzbekistan;\n- University degree in Law - or similar qualifications or experience\nwithin legal issues;\n- Previous experience in the legislative drafting process;\n- Knowledge within the fields of comparative jurisprudence and\nconstitutional law, organisational work of parliaments with bicameral\nsystem, civil society, democracy and human rights issues, or public\nawareness, information and IT; \n- Proven excellent communication skills;\n- Proven training delivery skills;\n- Fluent in written and spoken English;\n- Knowledge of Uzbek/ Russian would be an advantage."}, {"name": "Web Project", "location": "NA", "description": "The company WEB PROJECT is currently seeking\nqualified candidates for positions of associates in work-online\nbusiness.", "qualification": "- PC proficiency in the level of a user;\n- Regular Internet access;\n- Working knowledge of MS Office (Word, Excel), E-mail, Internet;\n- Fluency in Russian and English languages;\n- Must be able to work online at any time at discretion.\nREMUNERATION:  500-1000 USD starting monthly earnings."}, {"name": "Microenterprise Development Fund Kamurj", "location": "Sisian, Armenia", "description": "Fund \"Kamurj\" is currently looking to recruit a Loan\nPromoter for its Sisian branch.", "qualification": "Applicants must be up to 40 years old and live\nin Sisian."}, {"name": "ACTR/ ACCELS", "location": "Yerevan, Armenia", "description": "The Country Director is responsible for maintaining\nAmerican Councils for International Education: ACTR/ ACCELS\norganizational relations in Armenia, overseeing internal operations in\nthe Yerevan office, and providing oversight of student, undergraduate,\ngraduate, post-graduate, and teacher and professional development\nexchange programs.", "qualification": "NA"}, {"name": "Eurasia Foundation", "location": "The Regional Director position is based in Tbilisi,\nGeorgia.", "description": "The Eurasia Foundation is seeking candidates to\nmanage a network of applied social science research and training centers\nin the South Caucasus.The CRRC centers offer training in modern social\nscience research methodologies and house key bibliographic and online\nresources for policy-oriented research in the social sciences. Centers\nalso work to promote regional networking for researchers and\ncross-border dialogue on the policy implications of research on key\nissues.", "qualification": "Candidates should have a minimum 5-8 years\nsenior project management or supervisory experience and should hold an\nM.A. or higher degree in public policy, management, law, or social\nscience. Candidates must be willing to work in and travel across the\nSouth Caucasus."}, {"name": "Accion Contra el Hambre - Armenia", "location": "Sisian, Armenia", "description": "ACH's Armenia Mission is seeking to employ a\nAdministrative Assistant/ Secretary for the Sisian Base office.", "qualification": "- Minimum two years relevant professional experience;\n- Good sense of organisating;\n- Good knowledge of computer (Word, Excel);\n- Fluent in English, Russian;\n- Good communication skills."}, {"name": "Small and Medium Entrepreneurship Development National Center of Armenia", "location": "Yerevan, Armenia", "description": "The SME DNC of Armenia is looking for a qualified\nperson to be hired on competitive basis for implementation of the Loan\nGuaranties pilot project stipulated as a separate point in \"SME\nDevelopment State Support Program 2004\". The project will be extended\nfurther depending on start-up output.", "qualification": "- Higher education in economics;\n- Minimum 1 year experience preferably in loaning;\n- Excellent knowledge in loaning;\n- Ability to travel a lot throughout the marzes;\n- Good knowledge of English;\n- Excellent computer skills."}, {"name": "United Nations Development Programme, Armenia", "location": "Yerevan, Armenia", "description": "The United Nations Development Programme in Armenia\nannounces opening for Project Coordinator for the Project \"Promoting\nHuman Rights and Facilitating Public Awareness of the Public Defender's\nOffice in Armenia. The incumbent under direct supervision of UNDP\nResident Representative will carry out overall coordination of the\nProject activities.", "qualification": "- Advanced University degree in human rights law, political science or\nrelated fields;\n- At least 8 years of related professional experience at national level\nand at least 5 years working experience with international\norganisations;\n- Good knowledge of human rights situation and the legal framework of\nthe country;\n- Ability to analyse problems, make recommendations, and present\nproposals for improvement or change in policies and procedures;\n- Ability to express ideas clearly and concisely, both orally and in\nwriting;\n- Demonstrate initiative, tact and high sense of responsibility and\ndiscretion;\n- Proficiency in the usage of computers and office software package (MS\nWord, Excel, Power Point) and competency in the handling of web based\nmanagement systems (Internet, Intranet);\n- Fluent in English and Armenian. Knowledge of Russian is an asset."}, {"name": "Interagent LLC", "location": "Yerevan, Armenia", "description": "- 6 days working week\n- Company provides new cars (Zhiguly 06), with an opportunity to acquire\nit in future.", "qualification": "- 20-35 years old\n- Valid driver's license\n- Minimum 1 year driving experience\n- Excellent communication skills\nREMUNERATION:  Starting salary: 200 USD"}, {"name": "IREX Armenia", "location": "Yerevan, Armenia\nDESCRIPTION:    The IREX/Armenia Internship Program offers meaningful,\ncareer-related work experience in an international organization to\nstudents and other interested individuals. The purpose of internship\nprogram is not only to provide individuals with professional experience\nthat is necessary for future work in an international organization, but\nalso to assist individuals in the development of key skills that will be\nbeneficial for their future careers in any sphere.  Every IREX intern\nwill be assigned a mentor who will work with the intern to assess\nindividual goals and performance through out the internship.  Each\nintern will complete a pre, mid, and post assessment designed to\ndetermine skills they would like to develop, progress being made, and\noverall performance and professional growth.  IREX internships are\nnon-paid, however, upon successful completion of the internship IREX\nwill provide interns with a certificate of appreciation and reference\nletter upon request.\nThe internship program serves to:\n- Reinforce and strengthen the interns' personal values and career\nobjectives through an improved understanding of themselves and the work\nenvironment\n- Assist students in identifying and acquiring the skills needed to\nenter a chosen field\n- Provide practical work experience to balance the students' theoretical\ntraining\n- Allow students to meet and learn from professionals in the field and\ndevelop a network of contacts\nInternship Areas:\n- Administrative Internship\nThe IREX Administrative Internship provides interns with experience in\nthe areas of public relations, secretarial support, translation and\ninterpretation.  Interns will be responsible for greeting visitors,\nresponding to walk in and telephone inquiries about IREX and its\nprograms, directing office communications to appropriate staff, editing\nof written text, assisting with daily administrative tasks such as\nwritten translation, oral interpretation, filing, copying, faxing,\ndrafting correspondence, research, and other duties as needed.\n- Program Internships\nThe IREX Program Internship provides interns with experience working\ndirectly with one or more of IREX's programs including public relations\nand outreach, event coordination, and administrative tasks related to\nspecific programs.  Interns will be responsible for responding to walk\nin and telephone inquiries related to the program, assisting program\nstaff with public outreach campaigns, assisting in the development and\nediting of outreach materials, assisting in event coordination and\nprogram related research, and various administrative tasks including but\nnot limited to written translation, oral interpretation, filing,\ncopying, faxing, and drafting correspondence.  IREX Program Interns are\nassigned to programs according to program needs, technical resources\navailable, and intern skills.  Possible placements include: the\nEducational Information Center (EIC) and Computer Based Testing Center,\nthe Internet Access Training Program (IATP), the Community Connection\nExchange Program, Partnerships and Training Division Education\nCurriculum Development Programs, and the Academic and Exchanges and\nResearch Division Alumni Program.", "description": "NA", "qualification": "NA"}, {"name": "UN World Food Programme, Armenia", "location": "Yerevan, Armenia", "description": "The United Nations World Food Programme is seeking an\nAdmin/ Finance Clerk for temporary assistance.", "qualification": "- University degree in economics or finance;\n- Knowledge of word processing and spreadsheet software packages; \n- Very good knowledge of Armenian and English; \n- At least three years of progressively responsible clerical work\nexperience in the field of finance, accounting, administration or other\nrelated field."}, {"name": "NetMen Ltd.", "location": "Yerevan, Armenia", "description": "We are looking for a Programmers with knowledge of\nJava, Jsp, J2EE.", "qualification": "- Minimum 3 years experience of software development;\n- Strong object oriented skills;\n- Strong technical background in Java software development, J2EE, XML,\nWeb Services, SOAP;\n- Strong OOA&D skills;\n- Practical knowledge of UML;\n- Experience with international projects;  \n- Knowledge of English and German languages (not mandatory, but a big\nplus).\nREMUNERATION:  Depends on skills and previous experience."}, {"name": "European Project for Regional Development of Armenia (REDAM)", "location": "Vayots Dzor, Armenia", "description": "Eurecna SLR, the international consulting\norganisation which has been awarded the contract by the Delegation of\nthe European Commission in Yerevan for the implementation of REDAM,\nseeks to fill the long-term position of Training and Institutional\nCapacity Building Specialist. We need an Armenian expert with extensive\nexperience conducting training needs analyses and institutional capacity\nanalyses, and developing training programmes. The candidate selected for\nthis position will be contracted for the next 18 months within the EU\nInternational Team to help strengthen the capabilities of civil servants\nat local, regional and central levels.\nEurecna is an equal opportunities employer.", "qualification": "- MSc. Degree in a relevant subject;\n- Formal training in training needs analyses and institutional capacity\nassessment methodologies;\n- Extensive experience (minimum 10 years) conducting training needs\nanalyses and developing training programmes;\n- Experience training civil servants a definite advantage;\n- Fluent in English and Armenian;\n- Good knowledge of decentralisation and local socio-economic issues;\n- Excellent leadership and workshop facilitation skills;\n- Fully computer literate a must;\n- Willingness to relocate;\n- Women are particularly encouraged to apply.\nREMUNERATION:  Competitive\nRELOCATION PACKAGE: Available"}, {"name": "IntraHealth/PRIME II", "location": "Lori Marz, Armenia\nPROJECT DESCRIPTION:   \nCommunity Education Campaign to Combat STIs/HIV/AIDS in Lori Marz\nRequest for Applications (RFA)\nRFA Solicitation Number: A10204\nRelease Date: 02/16/04\nLetter of Intent Receipt Date: 03/01/04 \nMeeting of Prospective Applicants: 02/24/04\nApplication Receipt Date: 03/15/04\nPoint of Contact: Lusine Ghazaryan\nE-mail: lghazaryan@...\nIntroduction and Purpose of the RFA\nIntraHealth International is an independent nonprofit corporation\naffiliated with the University of North Carolina at Chapel Hill.\nIntraHealth has earned an international reputation for innovative\nperformance improvement and training activities that benefit a wide\nvariety of providers in such areas as family planning, reproductive\nhealth, and safe motherhood. \nPRIME II is a global reproductive health project sponsored by the United\nStates Agency for International Development (USAID). A consortium of 7\ninternational agencies implements the project with IntraHealth\nInternational Inc. as the lead. Partners include Abt Associates,\nEngenderHealth, PATH, Training Resources Group, American College of\nNurse Midwives and Save the Children. PRIME II currently works with the\ngovernment of Armenia to expand access to quality reproductive health\nservices at the primary level through development of updated national\npolicies and protocols and through pilot implementation of those new\napproaches in Lori Marz. PRIME II's Human Immunodeficiency\nVirus/Sexually Transmitted Infections (HIV/STI) project supports the\ngovernment of Armenia to strengthen its efforts to prevent further\nspread of STIs in the population through preparing primary care\nproviders to offer integrated STI management and prevention services and\nby educating communities around those primary care centers about\nservices and appropriate prevention practices. Since May, 2003 STI\nSyndromic Management Guidelines and Algorithms were developed in close\ncollaboration with the Center of Dermatology, STIs and AIDS Prevention\nand the Ministry of Health, RA. As part of an overall program aimed at\nimproving health services in sexually transmitted infection treatment\nand prevention at the primary health care level, PRIME II has conducted\na Training of Trainers in STI Syndromic Management, based on the\nabove-mentioned guidelines. Participants who have undergone this\ntraining will be responsible for conducting training of primary care\nproviders in selected primary care sites in Lori Marz. This Request for\nApplications (RFA) invites applications on the implementation of a\ncommunity-based intervention to conduct community education campaign to\nprevent/combat HIV/STI among community inhabitants in Lori Marz. The\napplications are limited to local Armenian Non-Governmental\nOrganizations (NGOs) for projects of up to 6 months of duration to\nprovide informative/counseling/referral and other educational services\nto the target community members. \nIntraHealth will be the entity awarding the subcontracts. The\nsubcontracts may be awarded to one or more Armenian NGOs who have proven\ncapability to carry out successful activities in the field of public\nhealth and/or education. Awards will average $10,000 with a maximum of\n$12,000 (Documented in-kind contributions are strongly encouraged).\nThe purpose of this program is to raise awareness and knowledge of the\npopulation in issues related to the HIV/STI in professionally-accurate\nand culturally-appropriate ways and to mobilize actions to tackle\nHIV/STI. The program aims:\n-  to increase the awareness of the link between STIs and HIV/AIDS, \n-  to demystify and destigmatize these diseases, to combat the myths and\ntaboos associates with them,\n-  to promote prevention activities and practices,\n-  to increase use of services for treatment of STIs. \nAn important emphasis of the program is to provide referrals for\ncounseling and STI care management to the primary health care providers,\nalready trained by PRIME II in STI integrated care management.\nOn February 24th, 2004 IntraHealth will hold a meeting to review the\nRFA, answer questions as appropriate related to the RFA and provide\nguidance on the format of application. All prospective applicants are\ninvited to attend this meeting, which will take place on Tuesday,\nFebruary 24th at 14:00 in the Conference room of PRIME II at the\nfollowing address:\nIntraHealth/PRIME II\n31 Moskovyan Street, apt. #76a\nYerevan, Armenia 375002\nTelephone: (3741) 536-913\nFAX: (3741)532-697.\nIt is requested that all prospective applicants confirm their\nparticipation for the above-mentioned meeting by the close of business\nFebruary 20th, 2004.", "description": "NA", "qualification": "NA"}, {"name": "First Mortgage Company", "location": "Yerevan, Armenia", "description": "Excellent knowledge of Accounting/Tax filing both\nCentral Bank and Tax Dept., budget formation, presentation and control.", "qualification": "at least 3-4 years experience in\naudit/bank/lending\nREMUNERATION:   negotiable"}, {"name": "THE CENTER FOR COMMUNITY DIALOGUES AND INITIATIVES (CCDI)", "location": "Yerevan, Armenia", "description": "The accountant is a full-time national staff position\nbased in CCDI's Yerevan head office. Accountant is responsible for\noverseeing the daily financial operations of the organization (1 head\noffice and 8 field offices).\nCCDI runs double entry bookkeeping on accrual bases in compliance with\nthe National (International) Accounting Standards (NAS).  Accounting is\ncomputerized. Accounting software \"OC - 1\", MS Access based double entry\nbookkeeping.   Quicken also will be used for recordkeeping.  Some forms\nand tables are also done in Excel.\nOverall Job Functions, Major Duties, and Responsibilities\n- Development and implementation of effective accounting, internal\ncontrols, and fund control policies, procedures, and systems\n- Effective preparation, maintenance, and reporting of internal and\nexternal financial records and analyses\n- Oversee the daily financial operations and performance of the\norganization\n- Establish and maintain effective communication and coordination with\nmanagement and field offices\n- Maintain effective business relations with the bank and outside\nauditors/regulatory authorities", "qualification": "- Written and oral fluency in English, Armenian and Russian is required;\n- Advanced computer skills and competency in standard MS Office\napplications as well as Email/Internet, Quicken and Accounting software\n\"OC - 1\";\n- Essential knowledge of RA legislation (Civil and Labor Codes and Tax\nlegislation);\n- Minimum 3 years of experience in the related field with international\nand local organizations;\n- Demonstrated ability to maintain confidentiality. \n- Ability to work as a team member and independently;\n- Strong organizational skills and attention to details.\nThe above statements are intended to describe the general nature and\nlevel of work being performed. They are not intended to be construed as\nan exhaustive list of all responsibilities, duties and skills."}, {"name": "THE CENTER FOR COMMUNITY DIALOGUES AND INITIATIVES (CCDI)", "location": "Yerevan, Armenia", "description": "This is a full-time position based in CCDI's Yerevan\nhead office with frequent travel outside of Yerevan.\nOverall Job Functions, Major Duties, and Responsibilities\n- Administering, organizing, coordinating the activities and services\nprovided by the CCDI field offices.\n- Coordinating data collection and report submission by the CCDI field\noffices for all-organization reporting purposes/databases and for\nproviding analysis/trends for oversight purposes, development of new\ninitiatives, and ensuring a strategic approach to provision of services\nto clients.  \n- Coordination of public outreach/PR for the organization and by its\nfield offices.", "qualification": "NA"}, {"name": "Ameria CJSC", "location": "Yerevan, Armenia", "description": "Ameria CJSC is seeking qualified candidates for the\nposition of an in-house Graphic Designer for a company specializing in\nproduction of sweets and pastries.", "qualification": "- Professional background in graphic design;\n- Strong knowledge and experience in Corel Draw, Adobe Photoshop, Adobe\nIllustrator, Adobe PageMaker, etc.;\n- Strong understanding of composition, color matching, separates on\ndifferent output devices."}, {"name": "THE CENTER FOR COMMUNITY DIALOGUES AND INITIATIVES (CCDI)", "location": "Yerevan, Armenia", "description": "This is a full-time position based in CCDI's Yerevan\nhead office with frequent travel outside of Yerevan.", "qualification": "- Excellent communication skills. Friendly personality.\n- Proficiency in English, Armenian, and Russian.\n- Experience providing translation and interpretation between\nArmenian-English and Russian-English.\n- Excellent knowledge of Computer (Minimum required is Microsoft Office,\nInternet/Email.).\n- Good organizational skills.\n- Demonstrated ability to maintain confidentiality. \n- Records maintenance skills. \n- Work experience in the International organizations.\n- Willingness to work long or unusual hours/week-ends unexpectedly in\norder to meet goals and objectives.\n- Effective verbal and written communication skills. \n- Ability to work in a professional team environment.\n- Ability to perform multiple tasks at once.\nThe above statements are intended to describe the general nature and\nlevel of work being performed. They are not intended to be construed as\nan exhaustive list of all responsibilities, duties and skills."}, {"name": "Ameria CJSC", "location": "Yerevan, Armenia", "description": "Ameria CJSC is currently seeking qualified candidate\nfor the position of Supply Officer with a local company, producer of\nsweets and pastries.", "qualification": "- BA/BS in Business Administration, preferably with specialization in\nMarketing, MBA is a plus;\n- At least 2 years of relevant work experience;\n- Excellent written and oral communication skills in English, Armenian\nand Russian languages;\n- Computer literacy;\n- Good interpersonal skills."}, {"name": "US Government, OSI and the Civic Education Project", "location": "NA", "description": "NA", "qualification": "NA"}, {"name": "AGBU Armenian Representation Office", "location": "Yerevan, Armenia", "description": "The Armenian Representation of the Armenian General\nBenevolent Union is looking for a dynamic and creative person to fill\nthe position of Assistant to Director/ Translator.", "qualification": "- Completion of higher education; \n- Excellent command of written and oral English and Armenian. Good\nknowledge of Russian is a plus; \n- Advanced knowledge of MS Word (Word, Excel, Access and PowerPoint).\nWorking knowledge of web-design is desired."}, {"name": "Vekst Teknologi AS (VT)", "location": "Yerevan, Armenia", "description": "For our subsidiary in Yerevan, Armenia, we are\nlooking for Managing Director. The Managing Director (MD) has the\noverall responsibility for the activities and the economic result of the\ncompany, for communication and cooperation with customers, partners,\nowners, authorities and the public. MD is also responsible for managing\nthe personnel of the company. MD will under the guidance of the owners.", "qualification": "- University level education, preferably in a technical field, and more\nthan 5 years of working experience;\n- Business and goal-oriented leader who is respected and liked by the\ncolleagues. Your ambitions always lead the company to higher economical\nachievements;\n- Understanding and interest in technology, and industrial experience,\nespecially within processing industry, are important;\n- Knowledge of Armenian, Russian and English languages is required;\nother additional languages are valuable.\nREMUNERATION:   Negotiable"}, {"name": "World Vision Armenia", "location": "Yerevan, Armenia", "description": "World Vision Armenia announces a full-time position\nfor Project Assistant for the implementation of a Mobile Medical Teams\nand Primary Health care project. The position is based in World Vision\nArmenia' National office, Yerevan with extensive countrywide travel.\nCandidates must be flexible team players willing to travel extensively\nto field locations. \nThe Project Assistant will support the Yerevan based MMT staff with\nmiscellaneous administrative and project implementation duties.", "qualification": "- Experience in working with international organizations is required;\n- Experience of working in health projects is a plus;\n- Logical and analytical abilities, and demonstrated desire to learn;\n- Experience in utilizing spreadsheets and word processing systems;\n- Superb verbal and writing skills for English, Armenian and Russian. \n- Excellent interpersonal skills;\n- Ability to work independently and as a part of team;\n- Ability to interact with individuals and groups working in related\nareas and human relations capacity;\n- Agreement with World Vision Core Values and Mission Statement."}, {"name": "World Vision Armenia", "location": "Yerevan, Armenia", "description": "World Vision Armenia announces a full-time position\nfor MMT Project Manager for the implementation of a Mobile Medical Teams\nand Primary Health care project. The position is based in World Vision\nArmenia' National office, Yerevan with extensive countrywide travel.\nCandidates must be flexible team players willing to travel extensively\nto field locations. \nMMT project Manager will lead and work with other members of the MMT\nteam. This position is responsible for immediate Management and\noversight of program implementation, monitoring and evaluation,\nreporting.", "qualification": "The successful candidate will possess strong,\nbroad management skills and understanding, with clearly demonstrated\ntalent to operate successfully within a fluid team context to achieve\norganizational objectives.\n- At least 2 years of relevant experience with international\norganizations in a similar position;\n- Experience in working with government officials, NGOs, Donor agencies\nis required;\n- Experience in monitoring, analyzing, and evaluating programmatic\ninformation is a must;\n- Excellent knowledge of Primary Health Care in Armenia; \n- Previous experience of working in USAID funded grants is a plus; \n- Previous management experience in the field of Primary Health Care is\na plus; \n- Medical background and Masters degree in Public Health from recognized\nuniversity are required. Advanced degree in Management, Development or\nother related field would be a plus;\n- Strong managerial and analytical skills;\n- Excellent time-management skills combined with strong interpersonal\nand communication skills;\n- Ability to motivate and integrate team members to achieve projected\ngoals; \n- Have well developed problem solving skills (innovative and creative); \n- Demonstrated ability to work collaboratively with a broad range of\nprofessional counterparts within and outside of the organization; \n- Prepared to spend at least 30% of time outside of Yerevan including\nsome overnight stays in the field; \n- Excellent verbal and writing skills of English, Armenian and Russian; \n- Agreement with World Vision Core Values and Mission Statement."}, {"name": "World Vision Armenia", "location": "NA", "description": "World Vision Armenia announces full-time positions\nfor Health Coordinators for the implementation of a Mobile Medical Teams\nand Primary Health care project. The positions are based in World Vision\nArmenia' National office, Yerevan with extensive countrywide travel.\nCandidates must be flexible team players willing to travel extensively\nto field locations. \nMMT Health Coordinators will be responsible for direct coordination,\nsupervision and technical monitoring of the program success and\nconstrains in Lori and Gegharkunik.", "qualification": "- At least 2 years experience of working in the field of public health\nwith a certain focus on primary Health Care. Experience in working with\ninternational organizations (at least 2 years), government officials,\nNGOs and medical community is required;\n- Medical qualification (MD) from recognized university with a post\ngraduate training in Public Health or Public Administration is a must;\n- Knowledge/ experience of primary health care combined with\ndemonstrated understanding of cost-effective health care services\nintegration and sustainability assurance;\n- Experience to work in the field with community health care workers\n(nurses, doctors) and communities;\n- Competency in data collection and analysis using qualitative and\nquantitative research approaches combined with excellent reporting\nskills;\n- Experience in utilizing spreadsheets, database programs (SPSS,\nEpiInfo, etc.), and word processing systems;\n- Up to 50% travel in regions is required;\n- Superb verbal and writing skills for English, Armenian and Russian;\n- Excellent interpersonal skills; \n- Ability to work independently and as a part of team;\n- Ability to interact with individuals and groups working in related\nareas and human relations capacity; \n- Agreement with World Vision Core Values and Mission Statement."}, {"name": "CHF International", "location": "Headquarters, Silver Spring, MD, USA", "description": "CHF International, an international development\nnon-profit organization, is currently seeking to fill the position of\nCommunication Assistant.\nCHF does not discriminate on the basis of any legally protected\ncharacteristic, including, race, sex, national origin, religion, age,\ndisability, or citizenship. All candidates must be currently eligible to\nwork in the US. Sponsorship and relocation are not available.", "qualification": "- Demonstrate the ability to juggle multiple projects simultaneously;\n- Experience in writing and editing;\n- Photo editing or multi-media experience is a plus;\n- Bachelor's degree required with 1-2 professional experience\n(post-undergrad);\n- Experience in a fast-paced corporate or agency environment preferred,\nas is experience with Adobe PhotoShop, Adobe PageMaker or QuarkExpress,\nMacromedia Dreamweaver, Macromedia Fireworks, WebTrends, and/or HTML.\n- English fluency; second language capabilities strongly preferred. \nREMUNERATION:   30's-40's"}, {"name": "Deloitte Emerging Markets", "location": "London, UK", "description": "We have an opening for a full-time for a Consultant\nlevel staff member in our London office within the Private Sector\nDevelopment (PSD) practice unit. Key goals of the practice include the\nexpansion of the portfolio of contracts funded by the UK Department for\nInternational Development and to maintain its reputation and presence in\nthe tourism consulting market. A key requirement for the post is an\nability to play a full part in the growth of the business.", "qualification": "- Flexibility and the capability to adjust to a fast paced environment; \n- Ability to work as part of the PSD team with minimal supervision; \n- Must possess a minimum of two to three years solid work experience,\npreferably in a consulting environment; \n- Prior experience with and knowledge of donor organisations (especially\nDFID) is highly desirable; \n- Ability to win new business and to grow personally within the\npractice; \n- Computer literacy - Internet, Outlook and Microsoft Office (Word,\nExcel, PowerPoint, Access);\n- Good communication/ interpersonal skills; \n- Sound geographical knowledge."}, {"name": "Academy for Educational Development, Armenia", "location": "Yerevan, Armenia", "description": "Academy for Educational Development is the primary\ncontractor to USAID to implement the human and institutional capacity\ndevelopment in Armenia. AED announces the job opening for Legal and\nFinance Assistant to work part-time.", "qualification": "- Education and work experience in the relevant areas and good\ninterpersonal skills.\n- Fluency in Armenian, English and Russian; \n- Strong computer skills."}, {"name": "Academy for Educational Development, Armenia", "location": "Yerevan, Armenia", "description": "Academy for Educational Development is the primary\ncontractor to USAID to implement the human and institutional capacity\ndevelopment in Armenia. AED announces the job opening for Manager of\nInformation Systems.", "qualification": "- Education and work experience in the relevant areas and good\ninterpersonal skills.\n- Fluency in Armenian, English and Russian; \n- Strong computer skills."}, {"name": "Academy for Educational Development, Armenia", "location": "Yerevan, Armenia", "description": "Academy for Educational Development is the primary\ncontractor to USAID to implement the human and institutional capacity\ndevelopment in Armenia. AED announces the job opening for Program\nSpecialist for Health/ Social Programs.", "qualification": "- Education and work experience in the relevant areas and good\ninterpersonal skills.\n- Fluency in Armenian, English and Russian; \n- Strong computer skills."}, {"name": "Academy for Educational Development, Armenia", "location": "Yerevan, Armenia", "description": "Academy for Educational Development is the primary\ncontractor to USAID to implement the human and institutional capacity\ndevelopment in Armenia. AED announces the job opening for Driver.", "qualification": "- Education and work experience in the relevant areas and good\ninterpersonal skills.\n- Fluency in English is desired; \n- Personal vehicle in a good shape and condition."}, {"name": "United Nations Development Programme", "location": "Yerevan, Armenia", "description": "The UNDP and the Ministry of Health seek\nprofessionals for the project \"HIV/AIDS and Uniformed Services''", "qualification": "- University degree in humanitarian sciences, public administration or\nrelated field with experience of working with international\norganizations (minimum 3 years);\n- Good knowledge on UNAIDS policies and strategies and familiarity with\nother global and regional initiatives, including Armenia project funded\nby Global Fund to fight AIDS, TB and Malaria;\n- Experience in providing assistance or administrative support to\ndevelopment projects;\n- Good communication skills; \n- Proficiency in the usage of computers and office software package (Ms\nWord, Excel, Internet, Intranet);\n- Proficiency in English and Armenian, Russian is an asset."}, {"name": "Synergy International Systems, Inc./Armenia", "location": "Yerevan, Armenia", "description": "Synergy International Systems, Inc./Armenia seeks to\nfill the long-term position of Software Developer. The responsibilities\nof this position are focused on core software development tasks in\nSynergy International Systems, Inc. Synergy's main focus is on\ndeveloping integrated state-of-the-art Web Database and Web Portal\nsystems for business intelligence, knowledge management and e-Government\nsolutions. \nThis position will be filled by a software developer with a proven\nhistory of producing quality software product in a commercial setting.\nExperience in a dynamic workplace with solid software developing\npractice is required. Ideally, this position will be filled by a\ncandidate who has experience in all aspects of the software development\nprocess; including design, implementation, testing and delivery.", "qualification": "- Degree in Computer Science, Information Technology or related\ndiscipline (Bachelor's Degree in the relevant field required, Master's\nDegree preferred); \n- At least 3 years of successful experience in software development;\n- Extensive development experience with current industry technologies\nincluding Java, SQL, etc. and related tools;\n- Working experience with and design of complex database systems (stored\nprocedures);\n- Experience in J2EE development (JSP/ Servlets);\n- Knowledge of one of programming languages (C++/Visual C++; VB);\n- Knowledge of HTML/XML, ASP/PHP.\nAdditional Characteristics:\n- Ability to work under pressure and in multi-task environment; \n- Ability to work in a team while being self-directed and highly\nmotivated;  \n- Excellent analytical and problem-solving skills and attention to\ndetail;\n- Excellent interpersonal and organizational skills;\n- Fluency in English."}, {"name": "EU TACIS Project \"Support to the Development of an Integrated Vocational\nEducation Training (VET) system\" in Armenia", "location": "Yerevan, Armenia", "description": "IFOA the international consulting company which has\nbeen awarded the contract by the delegation of the European Commission\nin Yerevan seeks to fill the post of Translator/ Interpreter.\nTranslator/ Interpreter will be responsible for providing language\nsupport services to the project and in particular to the Team Leader and\nInternational experts", "qualification": "- Higher education;\n- Fluent in written and spoken Armenian, English and Russian;\n- Computer literate;\n- Good communication and interpersonal skills;\n- Self-initiative skills.\nREMUNERATION:   Remuneration package will be competitive."}, {"name": "EU TACIS Project \"Support to the Development of an Integrated Vocational\nEducation Training (VET) system\" in Armenia", "location": "Yerevan, Armenia", "description": "IFOA the international consulting company which has\nbeen awarded the contract by the delegation of the European Commission\nin Yerevan seeks to fill the post of Office Secretary. Office secretary\nwill be responsible for providing a range of secretarial and logistical\nservices to the project.", "qualification": "- Good standard of education;\n- Relevant work experience;\n- Fluent in Armenian;\n- Good working knowledge of written and spoken  English and Russian;\n- Computer literate including Word, Excel and CD/RW file back-up\noperations;\n- Minimum keyboard speed of 70 words per minute;\n- Good communication and interpersonal skills;\n- Self-initiative skills;\n- Familiar with operation and maintenance of modern office equipment.\nREMUNERATION:   Remuneration package will be competitive."}, {"name": "United Nations Development Programme", "location": "Yerevan, Armenia", "description": "The UNDP and the Ministry of Health seek\nprofessionals for the project \"HIV/AIDS and Uniformed Services''", "qualification": "- Advanced university degree in public health or related field with at\nleast 3 years of working experience with international organizations;\n- Good knowledge on the institutional framework of the Armenia's\nHIV/AIDS Prevention system;\n- Good knowledge on UNAIDS policies and strategies and familiarity with\nother global and regional initiatives, including Armenia project funded\nby Global Fund to fight AIDS, TB and Malaria;\n- Strong analytical skills, ability to make recommendations and present\nproposals for improvement or change of project activities; \n- Proficiency in the usage of computers and office software package (MS\nWord, Excel, Internet, Intranet);\n- Good team work spirit;\n- Proficiency in Armenian and Russian, good knowledge of English is an\nasset."}, {"name": "EU TACIS Project \"Support to the Development of an Integrated Vocational\nEducation Training (VET) system\" in Armenia", "location": "Yerevan, Armenia", "description": "IFOA the international consulting company which has\nbeen awarded the contract by the delegation of the European Commission\nin Yerevan seeks to fill the post of Office Manager. Office Manager will\nbe responsible for maintaining an efficient and well run project office\nin Yerevan.", "qualification": "- Higher education;\n- Relevant work experience;\n- Fluent in Armenian and English;\n- Good working knowledge of Russian;\n- Computer literate;\n- Good organisational and interpersonal skills;\n- Self-initiative and problem solving skills;\n- Experience in maintaining financial records;\n- Knowledge of TACIS accounting regulations is an advantage.\nREMUNERATION:   Remuneration package will be competitive."}, {"name": "Medecins Sans Frontieres - Belgium", "location": "Gegharkunik Marz, Armenia", "description": "Medecins Sans Frontieres - Belgium is seeking an\nEnglish Translator/ Interpreter to work in the framework of its Mental\nHealth project in Gegharkunik Marz.", "qualification": "- Corresponding higher education;\n- Corresponding work experience, preferably with international\norganizations;\n- Good computer skills;\n- Strong communication skills and high level of motivation;\n- Availability to be based in Sevan during weekdays;\n- Ability to travel frequently within Armenia."}, {"name": "Graduate School of Journalism, Columbia University, NY", "location": "NA", "description": "NA", "qualification": "NA"}, {"name": "Vem Radio Station", "location": "Yerevan, Armenia", "description": "Vem Radio Station (FM 101.6) is seeking a qualified\nAdministrative Assistant.", "qualification": "- University degree preferably majoring in English language;\n- Excellent writing skills;\n- Strong interpersonal and presentation skills;\n- Fluency in Armenian, English and Russian;\n- Working experience as an Administrative Assistant is preferable."}, {"name": "American Embassy Yerevan\nANNOUNCEMENT NUMBER: 04-07", "location": "NA", "description": "Provides research, reporting, advisory and related\nservices to broad scope and sensitivity in the field of political\nreporting. Follows issues involving Armenian political events as well as\nhuman rights, refugees, national minorities, women and children rights.\nObtains information and prepares factual and analytical reports.\nA copy of the complete position description listing all duties and\nresponsibilities is available in the Human Resources Office. Contact\nnumber: (3741) 52-46-61", "qualification": "NOTE: All applicants are instructed to\naddress each selection criterion detailed below with specific and\ncomprehensive information supporting each criteria.\n- University degree or equivalent, with strong background in history,\nsocial sciences, international relations, law, or other field demanding\nanalytical and writing skills;\n- Three years of progressively responsible work in an office or academic\nenvironment;\n- Level 4 (fluent) in English and Russian and level 5 (professional) in\nArmenian;\n- Strong social, interpersonal and telephone skills;\n- Knowledge of Armenian history, culture, political institutions,\nstructure, government and foreign relations.\nSELECTION PROCESS:   When equally qualified, Eligible Family Members and\nU.S. Veterans will be given preference. Therefore, it is essential that\nall candidates address the required qualifications above in the\napplication. \nADDITIONAL SELECTION CRITERIA: \n1. Management will consider nepotism/ conflict of interest, budget, and\nvisa status in determining successful candidacy.\n2. Current employees serving a probationary period are not eligible to\napply.\n3. Currently employed AEFMs who hold a FMA appointment are ineligible to\napply for advertised positions within the first 90 calendar days of\ntheir employment.  \nREMUNERATION:  *EFM/MOH/NOR: Position Grade: FP-05 to be confirmed by\nWashington\n*Ordinarily Resident: Position Grade: FSN-9"}, {"name": "Yerevan Brandy Company", "location": "Yerevan, Armenia", "description": "Yerevan Brandy Company is seeking qualified\ncandidates to fill the position of Technical Project Manager.", "qualification": "- Technical education (qualification of an engineer-mechanic is\ndesirable);\n- At least 2 years of mechanical work experience;\n- Work experience in elaborating and coordinating technical projects;\n- Good knowledge of English language;\n- Knowledge of MS Office.\nREMUNERATION:   Will be commensurate with the norms accepted in the\ncompany."}, {"name": "Yerevan Brandy Company", "location": "Yerevan, Armenia", "description": "Yerevan Brandy Company is seeking qualified\ncandidates to fill the position of Technical Project Manager.", "qualification": "- Higher technical education (qualification of an engineer is\ndesirable);\n- Excellent knowledge of the AutoCAD and relevant work experience with\nthat programme;\n- Good knowledge of English language.\nREMUNERATION:   Will be commensurate with the norms accepted in the\ncompany."}, {"name": "H2 ECOnomy", "location": "Yerevan, Armenia", "description": "H2 ECOnomy is seeking qualified candidate to fill the\nposition of Chemist - Organic/ Polymer.", "qualification": "- Advanced degree in chemistry;\n- Knowledge of Armenian, Russian is essential and English language is\ndesirable.\nREMUNERATION:   Competitive"}, {"name": "OSCE Yerevan Office", "location": "Yerevan, Armenia", "description": "The OSCE Office in Yerevan invites applications from\nhighly qualified, energetic and experienced Armenian professionals for\nthe post of Language and Administrative Assistant.", "qualification": "- Secondary education with a specialization in the English language; \n- Formal training in translation would be a strong asset; \n- Excellent English, Armenian and Russian language skills (written and\noral); \n- A practical translation/ interpretation experience with legal\nterminology would be an asset; \n- Previous experience of working for international organizations will be\nalso an asset;\n- Excellent interpersonal and communication skills, strong\norganizational and time management skills are a must; \n- Advanced computer skills, including word processing, spreadsheet and\ndesktop publishing programmes."}, {"name": "USAID, DCHA and LWVF", "location": "NA", "description": "NA", "qualification": "NA"}, {"name": "ONCE, Spain", "location": "NA", "description": "NA", "qualification": "NA"}, {"name": "World Vision Armenia", "location": "Yerevan, Armenia", "description": "World Vision Armenia encourages strong, experienced\nand inspired Managers in the field of Primary Health Care to apply for\nthis strategic position that will provide leadership and oversight to\nthe development and implementation of the MMT project as per the\nrequirements of USAID and World Vision.", "qualification": "The successful candidate to manage this\nproject will demonstrate the following qualifications and competencies:\n- Medical background and Masters degree in Public Health from recognized\nuniversity;\n- At least 2 years of relevant management experience with international\norganizations;\n- Proven experience in working with government officials, NGOs and Donor\nagencies;\n- Strong skills in management, monitoring, analyzing, and evaluating of\nprogrammatic information;\n- Excellent knowledge of Primary Health Care in Armenia;\n- Previous experience of working in USAID funded grants is a plus;\n- Proven time-management skills combined with strong interpersonal and\ncommunication skills;\n- Ability to motivate and lead team members to achieve projected goals;\n- Demonstrated problem-solving, negotiation and skills;\n- Demonstrated ability to work collaboratively with a broad range of\nprofessional counterparts within and outside of the organization;\n- Prepared to spend at least 30% of time outside of Yerevan including\nsome overnight stays in the field;\n- Fluent in verbal and written English, Armenian and Russian;\n- Understands and agrees with World Vision Core Values and Mission\nStatement."}, {"name": "Career Placement and Counseling Office (CPCO)\nAgribusiness Teaching Center \nArmenian Agricultural Academy", "location": "Yerevan, Armenia", "description": "The Career Placement and Counseling Office (CPCO)\nwithin the Armenian Agricultural Academy (AAA) is designed to serve the\ngraduates of the AAA and is intended to increase the employment\npotential of recent AAA graduates and support their job placement within\nArmenia's agribusiness sector. The Office will develop linkages between\nthe AAA and Armenian private enterprises, NGOs and local farmer\nassociations. The Office will also advise graduating students on\nadvanced domestic and international degree programs and participate in\nrecruitment of students from the rural areas of Armenia. \nThe Project is funded by Eurasia Foundation, the Cafesjian Family\nFoundation and USDA MAP.", "qualification": "- Masters degree in Public Relations or Human Resources or experience in\na similar position;\n- Minimum of 2 years related work experience;\n- Knowledge of local businesses and NGOs;\n- Excellent interpersonal and communication skills;\n- Excellent language skills in Armenian and English, Russian is an\nasset;\n- Excellent computer skills (MS Access, Word, Excel, Power Point, etc.),\nability to set up and use databases."}, {"name": "Save The Children - Armenia Field Office", "location": "Yerevan, Armenia", "description": "The Project Officer oversees daily operations and\ntechnical quality of the Community Self-Help Fund (CSHF) projects and\nprovides technical support to small sub-grants' recipients through the\nimplementation process. The Project Officer is responsible for assuring\ncommunity-based projects' quality and adherence to CSHF criteria and\nprocedures and SC's policies and procedures. This person is responsible\nfor maintaining collaborative working relationships with sub-grantees\nand is taking an active role in coordination of program interventions\nwith local level governments. The Project Officer reports to the CSHF\nProgram Manager (PM) and oversees successful and timely implementation\nof sub-grantees' activities.", "qualification": "- Degree from a recognized institute in social science, economics,\nengineering or any related field;\n-  minimum of three years working experience for a local or an\ninternational humanitarian relief and development organization with\nparticular emphasis on community and NGO development;\n- Good analytical and organizational skills. High level of maturity,\nresponsibility and accountability. Sound judgment and attention to\ndetails;\n- Excellent interpersonal skills, including patience, diplomacy,\nwillingness to listen and respect for colleagues. Must be capable of\nworking both individually and as a part of a Team;\n- Ability to work effectively in a fast-paced, stressful environment.\nMust be flexible. Willing to perform other duties and work irregular\nhours;\n- Fluency in written and spoken Armenian. Fluency in written and spoken\nEnglish is a must! Applicants who do not pass a written test will not be\ninvited to an interview;\n- Excellent computer skills in MS Word and Excel."}, {"name": "US DEPARTMENT OF AGRICULTURE MARKETING ASSISTANCE PROJECT", "location": "Yerevan, Armenia\nDESCRIPTION:   USDA MAP office is seeking an Intern to assist the\nMarketing Team staff in implementing marketing projects in Armenia. This\nis a great opportunity for young professionals to experience\nproject-oriented work environment with American and Armenian\nconsultants. USDA MAP is predominantly working with the Armenian\nagribusinesses.\nRESPONSIBILITIES:  Interns' main responsibilities will include:\n- Data collection, information gathering, Internet search;\n- Assistance for trade show organization;\n- Assistance with logistics; \n- Drafting reports and maintaining correspondence;\n- Maintaining contacts with USDA MAP clients; \n- Other duties as may be requested to assist with Marketing Department\nactivities.", "description": "NA", "qualification": "- Fluency in written and oral English and Armenian. Good knowledge of\nRussian would be an asset;\n- Demonstrated proficiency in MS Word, Excel, Internet usage; \n- University degree, preferably in marketing; \n- Willingness to work outdoors and travel to rural areas;\n- Willingness to work extended hours and weekends if requested;\n- Ability to work in a team environment; excellent interpersonal and\norganizational skills."}, {"name": "\"Intarnet\" Ltd", "location": "Yerevan, Armenia", "description": "The IT company is looking for high qualified Game\nDevelopers to form a dynamic team that will work on various Game\nDevelopment projects.", "qualification": "Experience in game developing.\nThe selection will be based upon the work experience, skills, abilities\nand created game demo versions."}, {"name": "Education for Sustainable Development Foundation (ESDF)", "location": "Yerevan, Armenia", "description": "In close coordination with the Board of Trustees, the\nposition holder will develop and implement an integrated strategy for\nthe Education for Sustainable Development Foundation (ESDF); provide\noverall operational and technical management of ESDF including\noverseeing programs design and development, implementation and\nevaluation; serve as a key liaison between the ESDF and partner\norganizations, donors and the NGO community; lead and maintain\nfundraising initiatives and network/ linkages with potential partners\nand outreach components.", "qualification": "- Three years of experience in NGO sector;\n- Working experience with international organizations;\n- Experience in working with government officials and donor community;\n- Good knowledge of international donor assisted education and social\nprograms; \n- University diploma in Education, Social Sciences or other related\nfield;\n- Master's degree in Management or Public Administration is a plus;\n- Self-guided with strong organizational and planning skills;\n- Strong managerial and analytical skills;\n- Strong interpersonal, communication and negotiation skills;\n- Strong leadership and mentoring skills;\n- Strong capacity building and teambuilding/ facilitation skills;\n- Excellent time-management skills;\n- Experience of and commitment to team approaches and participatory\nmethods of working with groups of people, excellent proposal writing\nskills;\n- Proven ability to motivate and integrate team members to achieve\nprojected goals;\n- Innovativeness and creativity;\n- Exceptionally strong conceptualization and problem solving skills;\n- Demonstrated ability to work collaboratively with a broad range of\nprofessional counterparts within and outside of the organization;\n- Experience in utilizing spreadsheets and word processing systems;\n- Superb verbal and writing skills for English and Armenian. Russian\nwould be a plus."}, {"name": "Bars Media", "location": "Yerevan, Armenia", "description": "We are looking for a Corporate Director to head up\nthe Corporate Film Unit and the Design Unit. This is a senior\nmanagement. He/she will be fully responsible for the management and\ndeliverables of the corporate/ design department. The Corporate Director\nassist the units with the day to day management of their work loads, set\nfuture targets, and insure quality control. The Corporate Director will\nalso get involved in attracting more clients through active involvement\nin the international community of Yerevan, Armenia.", "qualification": "- Excellent managerial skills;\n- Fluency in written and spoken English;\n- 1-3 years managerial experience in an international organization;\n- At least half a year academic or work related experience overseas;\n- Excellent organizational skills;\n- Proven leadership skills;\n- Experience in writing proposals (in English);\n- Experience in media/ broadcasting will be a plus; \n- The candidate should be comfortable working in high pressure, deadline\noriented, work environments."}, {"name": "Military Institute MoD RA", "location": "Yerevan, Armenia", "description": "NA", "qualification": "- Degree in Computer Science, Information Technology or related\ndiscipline (Bachelor's Degree in the relevant field required, Master's\nDegree preferred); \n- At least 3 years of teaching experience;\n- Knowledge of one of programming languages (C++/Visual C++; VB);\n- Knowledge of Ms Office 2000.\nAdditional Characteristics:\n- Ability to work under pressure; \n- Ability to work in a team.\nREMUNERATION:   45000 Drams"}, {"name": "Valensia Expo", "location": "Yerevan, Armenia", "description": "Valensia Expo is looking for a Marketing Specialist,\nCommodity Export.", "qualification": "- Postgraduate degree will be considered as a plus;\n- Previous work experience in a relevant position will be considered as\na plus;\n- Fluent knowledge of Russia, English and computers;\n- Dyamic and ambitious personality;\n- Managing and organizing skills;\n- Team spirit."}, {"name": "\"Compass\"  Ltd", "location": "Yerevan, Armenia", "description": "We are looking for highly qualified, energetic and\nexperienced professionals to fill the position of Assistant to Director.", "qualification": "- Secondary education with a specialization in the English language; \n- Excellent English, Armenian and Russian language skills (written and\noral); \n- A practical translation/ interpretation experience;\n- Previous experience of working for international organizations will be\nalso an asset;\n- Ability to prioritize competing tasks, even under pressure, in a\nmethodical and systematic manner;\n- Experience in working using her/his own initiative as well as working\nin a team;\n- Excellent inter-personal and communication skills;\n- Excellent organizing skills, including event organization;\n- An international outlook and interest in developmental issues;\n- Comfortable in dealing with high-level dignitaries and working in an\ninternational environment;\n- Flexibility and good humor are essential.\nREMUNERATION:   Competitive"}, {"name": "ACRA Credit Bureau", "location": "Yerevan, Armenia", "description": "ACRA Credit Bureau seeks to fill the long-term\nposition of IT specialist. Ideally, this position will be filled by a\ncandidate who has experience in all aspects of the software development\nprocess, including design, implementation, testing and delivery.", "qualification": "The successful candidate will demonstrate the\nfollowing qualifications and competencies:\n- Degree in Computer Science, Information Technology or related\ndiscipline (Bachelor's Degree in the relevant field required, Master's\nDegree preferred);\n- At least 2 years of  job experience;\n- Knowledge and experience on Oracle database;\n- Database design, proficiency in SQL, PLSQL; \n- Knowledge and experience in software application development in Java\nprogramming language;\n- Experience in developing client/server applications and/or web based\napplications in Java running on Oracle database;\n- Knowledge of setting network, software setup and maintenance is a\nplus.\nAdditional Characteristics:\n- Ability to work under pressure and in multi-task environment; \n- Ability to work in a team while being self-directed and highly\nmotivated;  \n- Excellent analytical and problem-solving skills and attention to\ndetail;\n- Excellent interpersonal and organizational skills;\n- Fluency in English and Armenian.\nREMUNERATION:   Competitive, depends on skills and previous experience."}, {"name": "Minority Rights Group International", "location": "Strasbourg, France \nDESCRIPTION:   As part of ongoing work on the Framework Convention for\nthe Protection of National Minorities, Minority Rights Group\nInternational is organising a Training on the Framework Convention for\nthe Protection of National Minorities. The training is organised in\ncooperation with the FCNM Secretariat of the Directorate General of\nHuman Rights of the Council of Europe, and will be held in Strasbourg\nfrom 27th to 30th May 2004. The training is for minority based and\ninterethnic human rights NGOs from countries whose state reports are due\nin 2004 only. The training is open to NGOs from Armenia, Austria,\nCroatia, Cyprus, Czech Republic, Denmark, Estonia, Finland, Germany,\nHungary, Italy, Liechtenstein, Macedonia, Malta, Moldova, Romania,\nRussian Federation, San Marino, Slovak Republic, Slovenia, Spain,\nUkraine, and United Kingdom. The training is also open to NGOs from\nKosovo. \nThe objectives of the training will be to: \n- Provide information on the content of the Framework Convention and its\nmonitoring mechanism; \n- Identify ways in which NGOs can best contribute to the monitoring of\nthe implementation of the Convention, both at the domestic level and at\nthe level of the Council of Europe; \n- Provide opportunities for participating NGOs to make contact with\nother NGOs working on minority protection, Council of Europe staff,\nmembers of the treaty monitoring body, and their government\nrepresentatives to the Council of Europe; and \n- Develop follow-up activities, focusing on involvement in state\nreporting process, producing shadow reports, and related advocacy. \nThe programme will include presentations, case studies, discussions,\nsmall group and individual work. It will include an overview of\ninternational instruments and mechanisms for minority protection,\nincluding in-depth consideration of the Framework Convention, its\nmonitoring mechanism and opportunities for civil society to contribute.\nMethodologies will be participatory and the focus will be on practice.\nThere will be task groups on the development of NGO advocacy strategies\nto contribute to effective monitoring of State compliance and drafting\nadditional information/shadow reports. \nMRG will invite representatives of 25 NGOs from the target countries\nlisted above. \nParticipants will be selected on the basis of their organisations'\ninstitutional capacity and commitment to raise awareness of minority\nrights and monitor implementation of international instruments,\nspecifically the Framework Convention, and their own professional\nexperience. \nPriority will be given to NGOs who: \n- Prioritise advocacy for protection of minority rights (international\nexperience is not needed, but experience and organisational commitment\nto working on minority protection at the domestic level is key) \n- Are interested in producing shadow reports on the Framework Convention\nand being involved in the state reporting process. \nNGO representatives applying to the training have to be staff members of\ntheir organisations, and should have: \n- Experience in advocacy work; \n- Commitment to human and minority rights; \n- In-principle support from the management of their organisation to take\nforward work on monitoring the Framework Convention; \n- Very good English language skills. Unfortunately, the budget does not\nallow for interpretation costs and therefore participants should have\nvery good English language skills to be able to participate actively in\ndiscussions. \nMRG will aim for a mixture of people from different countries, at least\n70% of whom will be from minority communities, and a gender balance. MRG\nwill select participants on the basis of their application and the above\norganisational and professional selection criteria. \nMRG will not select more than one participant from any one organisation.\nThe training is not open to organisations from which 2 or more persons\nhave participated in MRG's Strasbourg FCNM training since 2000. Anyone\nnot sure how many persons from their organisation have participated in\nMRG's previous FCNM trainings can contact MRG to double check. \nREMUNERATION:  Costs of travel, accommodation, and subsistence will be\ncovered by MRG for all selected applicants.", "description": "NA", "qualification": "NA"}, {"name": "Reebok Human Rights Program, USA", "location": "NA", "description": "NA", "qualification": "NA"}, {"name": "SEF International Universal Credit Organisation Ltd.", "location": "Yerevan, Armenia", "description": "SEF International Ltd. is looking to recruit\nqualified and experienced Accountant/ Financial Officer for its Head\nOffice in Yerevan. This position will carry out routine accounting as\nwell as be responsible for preparation of financial reports to local\nauthorities, including the Central Bank of RA.", "qualification": "- University degree or respected certificate in Finance or Accounting;\n- At least three years of relevant experience in micro-finance or\nbanking field; \n- At least two years of relevant experience in reporting to the Central\nBank of RA and tax authorities; \n- Proven knowledge of Generally Accepted Accounting Principles,\nInternational and Armenian Accounting Standards; \n- Ability to financial data processing; \n- Skills in fiscal reporting, ability to resolve taxation issues; \n- Practical knowledge of Central Bank of RA reporting, financial systems\nand internal controls in Armenia; \n- Analytical skills and good attention to details; \n- Computer literacy and working knowledge of word processor and\nspreadsheet applications; knowledge of Sun Systems is preferred; \n- Ability to work in a team and with multi-national staff; \n- Verbal and written communication skills in Armenian, English and\nRussian."}, {"name": "Food Security Regional Cooperation and Stability Programme in South\nCaucasus (FRCS)", "location": "Ijevan town, Tavush marz, Armenia.", "description": "Food Security Regional Cooperation and Stability\nProgramme in South Caucasus (FRCS) seeks to fill the position of\nCommunity Development, Capacity Building and Conflict Management\nConsultant.", "qualification": "- Higher Education and/or professional experience in economics,\ncommunity development or a related field;\n- Fluent knowledge of the Armenian, Russian and English languages\n(written and oral) is compulsory;  \n- Sufficient capabilities in carrying out sector analysis, providing\nconsultancies and drafting documents;\n- Computer skills MS Office 2000 (compulsory);\n- Personal initiative as well as ability and willing to work as a team\nmember;\n- Very good communication skills;\n- Work experience with international organizations (preferable);\n- Ability and willing to work overtime and under time pressure as well\nas frequent travels."}, {"name": "ACRA Credit Bureau", "location": "Yerevan, Armenia", "description": "ACRA Credit Bureau seeks to fill the position of Web\nDesigner. Ideally, this position will be filled by a candidate who has\nexperience in all aspects of Web Designing.", "qualification": "The successful candidate will demonstrate the\nfollowing qualifications and competencies:\n- Degree in Computer Science, Web Designing, Information Technology or\nrelated discipline (Bachelor's Degree in the relevant field required,\nMaster's Degree preferred);\n- At least 3 years of job experience in web design;\n- Knowledge of HTML and JavaScript;\n- Knowledge of ISP and PHP;\n- Fluency in written and spoken English, Armenian and Russian is a must.\nAdditional Characteristics:\n- Ability to work under pressure and in multi-task environment; \n- Ability to work in a team while being self-directed and highly\nmotivated;  \n- Excellent analytical and problem-solving skills and attention to\ndetail;\n- Excellent interpersonal and organizational skills.\nWe would like to see web pages that you had made."}, {"name": "Open Society Institute", "location": "NA", "description": "NA", "qualification": "NA"}, {"name": "Council of Europe and Budapest European Youth Centre", "location": "Budapest, Hungary\nDESCRIPTION:   Financial assistance in support of local pilot projects\nis important to the Youth Programme on Human Rights Education because it\nwill allow for new initiatives to be set up and will motivate supporting\nlocal NGOs and groups to undertake action related to human rights\neducation with young people. By funding pilot projects on human rights\neducation through the European Youth Foundation, the Directorate of\nYouth and Sport seeks to actively contribute to the inclusion of human\nrights education in youth work practice and to encourage innovative\npractices and partnerships, both in formal and in non-formal education\ncontexts. \nThe pilot projects will allow for a more visible and direct impact of\nthe programme at local level. They are a necessary complement to the\nrest of the youth programme on human rights education and to the other\nactivities of the Directorate of Youth and Sport of the Council of\nEurope. \nSimilarly, the inclusion of pilot projects in the European programme may\nserve to give them greater visibility and recognition, as well as\nfacilitating the development of networks and of opportunities to share\nexpertise and experiences. This will be done by means of the Directorate\nof Youth and Sport publications and web sites. This may be completed by\nan evaluation meeting and a publication with examples of good practice\nin 2005. \nThis financial support to pilot projects should be seen as exceptional\nand limited to the duration of the programme. The European funding can\nnot replace the necessary local and/or national co-funding (in money or\nin kind). In this context, the assessment of applications will consider\nalso the feasibility of the projects. \nPriority for funding will be given to projects which would otherwise be\ndifficult to start up. Funding will not be given to projects that have\nalready taken place. \nIn order to qualify for support, projects must: \n- Be directly related to young people and to human rights education or\nto a specific theme addressed by the programme; \n- Be prepared, run and managed by a local association, institution or\nyouth group acting directly with children, young people or a specific\ntarget group of the programme; \n- Have a clear educational or awareness-raising function; \n- Concern primarily participants under 30 years of age; \n- Have a participatory approach, from the conception to the evaluation; \n- Integrate intercultural learning in its educational approach; \n- Have an innovative character (in terms of methodology, target groups\naddressed, etc.); \n- Be open to other partners of the youth programme on human rights\neducation and foresee using the resources generated through the\nprogramme (e.g. the Manual on Human Rights Education); \n- Have a clear potential local impact while being open to European\nnetworks; \n- Have a European dimension, either by involving more than one country,\nand/or by taking into consideration the European context; \n- Follow the basic educational principles of the Council of Europe's\nyouth sector. \nSelected projects can be funded up to a maximum of 7.600 Euro.", "description": "NA", "qualification": "NA"}, {"name": "International Research & Exchanges Board (IREX)", "location": "IATP Armenia Main Office, Yerevan\nDESCRIPTION:   IREX currently seeks to fill the position of non-paid\nfull and part time Administrative and Programmatic Interns for the\nInternet Access and Training Program (IATP). The position is based in\nthe IATP Yerevan office.\nThe internship program serves to:\n- Reinforce and strengthen the interns' personal values and career\nobjectives through an improved understanding of themselves and the work\nenvironment;\n- Assist students in identifying and acquiring the skills needed to\nenter a chosen field;\n- Provide practical work experience to balance the students' theoretical\ntraining;\n- Allow students to meet and learn from professionals in the field and\ndevelop a network of contacts.\nThe program provides interns with experience in the areas of public\nrelations, secretarial support, translation and interpretation.  Interns\nwill be responsible for greeting visitors, responding to walk in and\ntelephone inquiries about IREX and its programs, directing office\ncommunications to appropriate staff, editing of written text, assisting\nwith daily administrative tasks such as written translation, oral\ninterpretation, filing, copying, faxing, drafting correspondence,\nresearch, and other duties as needed.", "description": "NA", "qualification": "- Fluency in English and Armenian;\n- Good communication skills;\n- Ability to work independently and as part of a team."}, {"name": "ABSER Ltd.", "location": "Yerevan, Armenia", "description": "ABSER Ltd. is looking for a personality to recruit\nhim in the area of car service financial management and business\ndevelopment. The position is a senior management. The incumbent will be\nresponsible for managing day to day activities and bringing the\nenterprise to more organized and modern condition in compliance with\nwestern management standards.", "qualification": "- Strong analytical skills, ability to make recommendations and present\nproposals for improvement or change of company activities;\n- Excellent time-management skills combined with strong interpersonal\nand communication skills;\n- Well developed problem solving skills (innovative and creative);\n- Demonstrated ability to work collaboratively with a broad range of\nprofessional counterparts within and outside the organization;\n- Demonstrated ability to maintain confidentiality;\n- Essential knowledge of RA legislation (Civil and Labor Codes and Tax\nlegislation, reporting requirements);\n- Minimum 2 years of experience in relevant field;\n- Degree in Business Administration;\n- Strong consulting skills as well as previous consulting experience."}, {"name": "International Research & Exchanges Board (IREX)", "location": "IREX Academic Programs Main Office, Yerevan, Armenia \nDESCRIPTION:   IREX currently seeks to fill the position of non-paid\nfull and part time Administrative and Programmatic Intern for the IREX\nAcademic Programs. The position is based in the Tekeyan Center, IREX\nYerevan office.\nThe internship program serves to:\n- Reinforce and strengthen the interns' personal values and career\nobjectives through an improved understanding of themselves and the work\nenvironment;\n- Assist students in identifying and acquiring the skills needed to\nenter a chosen field;\n- Provide practical work experience to balance the students' theoretical\ntraining;\n- Allow students to meet and learn from professionals in the field and\ndevelop a network of contacts.\nThe program provides interns with experience in the areas of public\nrelations, secretarial support, translation and interpretation.  Interns\nwill be responsible for greeting visitors, responding to walk in and\ntelephone inquiries about IREX and its programs, directing office\ncommunications to appropriate staff, editing of written text, assisting\nwith daily administrative tasks such as written translation, oral\ninterpretation, filing, copying, faxing, drafting correspondence,\nresearch, and other duties as needed.", "description": "NA", "qualification": "- Fluency in English and Armenian;\n- Good communication skills;\n- Ability to work independently and as part of a team."}, {"name": "UMCOR Armenia", "location": "NA", "description": "UMCOR Armenia is looking to hire a Finance Assistant/\nAccountant for its Yerevan and Goris Offices. The Finance Assistant/\nAccountant reports to Finance Director.", "qualification": "- University degree in Finance, Economics or Accounting;\n- Experience in financial sector;\n- Computer skills (Word and Excel);\n- Excellent analytical and organizational skills."}, {"name": "United Nations Development Programme", "location": "Yerevan, Armenia", "description": "The United Nations Development Programme in Armenia\nannounces opening for the position of  Engineer/ Supervisor for the\nGlobal Fund Project.", "qualification": "- Advanced University degree in Civil Engineering, Architecture or\nrelated discipline;\n- Minimum five years relevant experience in relevant field;\n- Experience in administering and supervision of civil and structural\nconstruction practices and quality control procedures;\n- Sufficient knowledge of building codes and regulations, construction\nterminology and pricing;\n- Ability to read and interpret technical drawings and specifications;\n- Previous exposure to international funded relevant projects preferably\nwith UN is an asset;\n-  Proficiency in the usage of computers and office software package (MS\nWord, Excel, Power Point) and competency in the handling of web based\nmanagement systems (Internet, Intranet);\n- Basic knowledge of CAD based programmes is a plus;\n- Fluent in Armenian, Russian and English."}, {"name": "USAID/Armenia", "location": "NA", "description": "NA", "qualification": "NA"}, {"name": "US DEPARTMENT OF AGRICULTURE \nMARKETING ASSISTANCE PROJECT", "location": "Yerevan, Armenia", "description": "Under the supervision of the USDA-MAP\nDirector/Coordinator, the Deputy Director will assist the Project\nDirector/Coordinator and provide oversight on all programs and their\noperations, with a strong focus on the technical and programmatic\naspects, monitoring and impact evaluation, training, coordination of MAP\nprojects with outside development implementers, and help build capacity\nwithin Armenian agribusinesses. The Deputy Director will advise the\nDirector/Coordinator on USDA-MAP programs on food marketing,\nagriculture, and rural and agribusiness development.", "qualification": "- Post-graduate academic qualifications/advanced university degree(s) in\na field of agriculture, agribusiness management, or food marketing\ncorresponding to one or more of the listed technical areas is strongly\npreferred;\n- A minimum of 10 years of technical, managerial, and logistical\nexperience with international and/or national Armenian organizations\ndealing with development issues with emphasis on agriculture, food\nmarketing, or rural development. Experience with USDA/USAID or other\ninternational organization(s) is highly desirable;\n- Experience in teamwork and team building skills, project/program\ncreation and management of complex assignments. Ability to lead and work\neffectively with a diverse team of people of different national and\ncultural backgrounds;\n- Good knowledge of Armenian private and public institutions and\npolicies;\n- Excellent communication and negotiation skills;\n- Excellent Armenian, Russian, and English communication skills, both\nverbal and written.  Computer skills, including Microsoft Word and\nExcel."}, {"name": "Valensia Hotel & Resort", "location": "Yerevan, Armenia", "description": "Valensia Hotel & Resort is looking for a Marketing\nSpecialist.", "qualification": "- Higher education;\n- Excellent knowledge of English language;\n- Excellent computer skills;\n- Dynamic and attractive personality;\n- Excellent communication skills and to be a skillful negotiator;\n- To be creative in promoting advertising ideas."}, {"name": "Microenterprise Development Fund \"Kamurj\"", "location": "Vanadzor, Armenia", "description": "MDF-Kamurj is currently looking to recruit a Loan\nPromoter for its Vanadzor branch.", "qualification": "- Applicants must be up to 40 years old and live in Vanadzor;\n- Willingness to spend 90% of time in the field;\n- Excellent facilitation skills;\n- Strong problem-solving skills and ability to work well with others."}, {"name": "Synergy International Systems, Inc.", "location": "Yerevan, Armenia", "description": "In close collaboration with John Snow, Inc and\nMinistry of Health of RA Synergy International Systems, Inc./ Armenia\ncurrently develops a pharmaceutical information management system.\nWithin the framework of this project Synergy International Systems,\nInc./Armenia seeks to fill the short-term position of Executive\nAssistant. \nThe responsibilities of this position are focused on providing technical\nassistance and administrative support to the core members of the\ndevelopment team and various other staff members involved in the\nproject. \nThis part-time position will be filled by a person with a Computer\nScience background. Graduates and Undergraduates are preferred. The\nExecutive Assistant shall perform such administrative duties as may be\nspecified by the Project Manager. The Executive Assistant will be chosen\nsolely on the basis of his/her qualifications of an assistant with\nparticular emphasis on his/her educational background, organizational\nand interpersonal skills.", "qualification": "- Undergraduate or Graduate degree in Computer Science, Information\nTechnology or related discipline (Bachelor's Degree in the relevant\nfield is preferred); \n- Successful experience in IT projects is desirable;\n- Familiarity with word processing software (MS Word and Excels);\n- Basic understanding of relational database management systems.\nADDITIONAL CHARACTERISTICS:  \n- Ability to work under pressure and in multi-task environment; \n- Ability to work in a team while being self-directed and highly\nmotivated;  \n- Attention to details;\n- Excellent interpersonal and organizational skills;\n- Fluency in English."}, {"name": "Synergy International Systems, Inc.", "location": "Yerevan, Armenia", "description": "Synergy International Systems, Inc./Armenia seeks to\nfill the long-term position of Senior Database Administrator. The\nresponsibilities of this position are focused on functional\nspecification definition, design, implementation, and maintenance of the\nlogical and physical database and data dictionary in compliance with\napplication specifications, company policies and company standards. \nThis position will be filled by a software developer with a proven\nhistory of database administration. Experience in a dynamic workplace\nwith solid database administration practice is required. Ideally, this\nposition will be filled by a candidate who has experience in all aspects\nof the database administration process, including design, creation, and\ntroubleshooting of databases.", "qualification": "- Degree in Computer Science, Information Technology or related\ndiscipline (Bachelor's Degree in the relevant field required, Master's\nDegree is preferred); \n- At least 4 years of successful experience in SQL design and\nadministration;\n- Extensive experience in Microsoft SQL Server 2000, all service packs\nand many hotfixes;\n- Recent hands-on experience in SQL including stored procedures,\nindexes, performance optimization and tuning, database architecture,\nDTS, script and object extensions to DTS, OLAP, and XML;\n- Experience in using VBScript as a part of DTS and other related tools;\n- In-depth knowledge of fundamental data modeling rules and techniques,\ndatabase schema, security processes, performance and tuning;\n- Knowledge of HTML/XML, ASP/PHP is a plus.\nADDITIONAL CHARACTERISTICS:  \n- Ability to work under pressure and in multi-task environment; \n- Ability to work in a team while being self-directed and highly\nmotivated;  \n- Excellent analytical and problem-solving skills and attention to\ndetail;\n- Excellent interpersonal and organizational skills;\n- Fluency in English."}, {"name": "IOS Partners, Inc.", "location": "Worldwide", "description": "IOS Partners Inc., a U.S. based International\nConsulting Firm, is seeking senior bank and non-bank financial sector\nexperts, prudential bank supervision and bank restructuring experts\ninterested in long and short-term assignment.", "qualification": "- A minimum of 10 years experience;\n- Fluency in English and Spanish is a requisite;\n- Professional experience in the Americas is considered a plus.\nREMUNERATION:   Competitive"}, {"name": "IOS Partners, Inc.", "location": "Worldwide", "description": "IOS Partners Inc., a U.S. based International\nConsulting Firm, is seeking candidates for potential long and short-term\ninternational project.", "qualification": "- A minimum of 5 years experience in the desired field and proven\nexpertise in one of the abovementioned sub-sectors;\n- A graduate degree in related area;\n- Working experience in the former Yugoslavia or the region is a plus;\n- Operational Expertise is a plus. \nREMUNERATION:   Competitive"}, {"name": "IOS Partners, Inc.", "location": "Worldwide", "description": "IOS Partners Inc., a U.S. based International\nConsulting Firm, is seeking senior pension and social insurance experts\ninterested in long and short-term assignment worldwide. IOS Partners\ncurrently has on-going insurance sector/ pension reform/ social\nsecurity/ social insurance/ social investment funds/ social delivery\nbenefit administration/ poverty reduction/ NGO development/ public\nadministration reform related projects and opportunities in Eastern\nEurope, Southeast, South and Central Asia, Africa and Latin America.", "qualification": "- A minimum of 5 years experience and proven expertise in one of the\nabovementioned sub-sectors.\n- For positions in Central and South America, fluency in English and\nSpanish is a requisite.\nREMUNERATION:   Competitive"}, {"name": "International Medical Corps", "location": "Worldwide", "description": "Country Directors for Angola, Chad, Russian\nFederation, Sudan, and Tanzania IMC is seeking Country Directors to\nimplement, monitor and report on all country programs in addition to\ndesigning new program initiatives for our relief and development\nprograms. The selected candidates will plan, design, implement,\nsupervise, expand/develop and administer project and country programs.", "qualification": "- Minimum five years of field experience in international humanitarian\nrelief programs with a focus in health;\n- Knowledge of donor practices, the program proposal process, and\nhumanitarian/ development program solicitations;\n- Familiarity with international humanitarian operations, coordination\nstructures, and the mandates of donors, UN agencies, and other NGOs;\n- Ability to read, analyze, and interpret administrative reports,\ntechnical procedures, and governmental regulations;\n- Ability to write reports, proposals, and procedure manuals;\n- Ability to effectively present information and respond to questions\nfrom managers, counterparts, MOH, Regional Director and HQ;\n- Fluency in English (both oral and written), Arabic and French highly\ndesired."}, {"name": "IOS Partners, Inc.", "location": "Worldwide", "description": "IOS Partners Inc., a U.S. based International\nConsulting Firm, is seeking candidates for potential long and short-term\ninternational project.", "qualification": "- A minimum of 5+ years of experience in the desired field;\n- A graduate degree in related area; \n- Working experience in the former Yugoslavia or the region is a plus.\nREMUNERATION:   Competitive"}, {"name": "Peace Corps - Armenia", "location": "The Trainers will live in Dilidjan (driving time\nfrom Yerevan will be 1,5 hours)", "description": "The United States Peace Corps program in Armenia\nseeks qualified and motivated candidates for temporary positions as\nLanguage and Cross-Cultural Facilitators during our upcoming Pre-Service\nTraining Program which will take place in Dilijan. Selected LCFs will be\nliving with host-families in towns and villages near Dilijan.", "qualification": "Successful candidates will \n- Have Armenian or English philology as a major or second subject;\n- Have teaching experience and/or desire to be taught how to teach\nArmenian to foreigners following modern communicative language learning\napproaches for adults;\n- Be able to work full-time between May 24 and August 21;\n- Be willing to work cooperatively as part of a team;\n- Speaking English is essential."}, {"name": "Peace Corps - Armenia", "location": "The Trainers will live in Dilidjan (driving time\nfrom Yerevan will be 1,5 hours)", "description": "As a member of the PST staff, the EE Technical\nCoordinator is responsible for the design, implementation and evaluation\nof the technical component of Pre-Service of Training.", "qualification": "- A University degree (preferably in Environment or Environmental\nEducation);\n- The applicant must have experience with international teaching\nmethodologies: experience with curriculum development; demonstrated\nfacilitation and training skills; experience with administration and\nmanagement; experience in supervision; experience in counseling;\n- Demonstrated flexibility and ability to work within strict time\nframes."}, {"name": "Peace Corps - Armenia", "location": "The Trainers will live in Dilijan (driving time\nfrom Yerevan will be 1,5 hours)", "description": "As a member of the PST staff, the Business Education\nCommunity Development (BECD) Technical Coordinator is responsible for\nthe design, implementation and evaluation of the technical component of\nPre-Service of Training.", "qualification": "- A University degree in in business or economics and relevant,\nprofessional experience;\n- The applicant must have experience with international teaching\nmethodologies: experience with curriculum development; demonstrated\nfacilitation and training skills; prior experience with administration\nand management; prior experience in supervision; prior experience in\ncounseling;\n- Demonstrated flexibility and ability to work within strict time\nframes."}, {"name": "Peace Corps - Armenia", "location": "The Trainers will live in Dilijan (driving time from\nYerevan will be 1,5 hours)", "description": "As a member of the PST staff, the CHE Technical\nCoordinator is responsible for the design, implementation and evaluation\nof the technical component of Pre-Service Training.", "qualification": "- A University degree (preferably in Public Health or Health Education);\n- Experience with international teaching methodologies: experience in\ncounseling; \n- Demonstrated flexibility and ability to work within strict time\nframes."}, {"name": "Peace Corps - Armenia", "location": "The Trainers will live in Dilijan (driving time\nfrom Yerevan will be 1,5 hours)", "description": "As a member of the PST staff, the TEFL Technical\nCoordinator is responsible for the design, implementation and evaluation\nof the technical component of Pre-Service of Training.", "qualification": "- A University degree with English language;\n- The applicant must have experience with international teaching\nmethodologies: experience with curriculum development; demonstrated\nfacilitation and training skills; prior experience with administration\nand management; prior experience in supervision; prior experience in\ncounseling; \n- Demonstrated flexibility and ability to work within strict time\nframes."}, {"name": "US DEPARTMENT OF AGRICULTURE MARKETING ASSISTANCE PROJECT", "location": "Yerevan, Armenia", "description": "USDA MAP office is seeking an Intern to assist the\nMarketing Team staff in implementing marketing projects in Armenia. This\nis a great opportunity for young professionals to experience\nproject-oriented work environment with American and Armenian\nconsultants. USDA MAP is predominantly working with the Armenian\nagribusinesses.", "qualification": "- Fluency in written and oral English and Armenian;\n\n- Good knowledge of Russian would be an asset;\n\n- Demonstrated proficiency in MS Word, Excel, Internet usage; \n\n- University degree, preferably in marketing; \n\n- Willingness to work outdoors and travel to rural areas;\n\n- Willingness to work extended hours and weekends if requested;\n\n- Ability to work in a team environment; excellent interpersonal and\norganizational skills."}, {"name": "ABSER Ltd.", "location": "Yerevan, Armenia", "description": "ABSER Ltd. is looking for a personality to recruit\nhim in the area of car professional and non professional audio systems\nsales. The incumbent must have strong willingness and interest to become\none of the best advisors in car audio systems market.", "qualification": "- Previous experience in the area of audio equipment sales and/or\nrepair.\n- Knowledge or strong willingness to learn audio equipment related terms\nand abbreviations in English.\n- Outstanding interpersonal and communication skills.\n- Ability to perform several activities at the same time.\n- Have real military service passed."}, {"name": "\"Digital Technologies\" LLC", "location": "Yerevan, Armenia", "description": "\"Digital Technologies\" LLC is looking for a Sales\nTechnical Adviser.", "qualification": "- Excellent knowledge of English, Armenian, Russian languages;\n- Excellent computer skills;\n- Higher technical education;\n- Applicants must be male and 22-35 years old."}, {"name": "\"Digital Technologies\" LLC", "location": "Yerevan, Armenia", "description": "\"Digital Technologies\" LLC is looking for a Sales\nClerk/ Referent.", "qualification": "- English, Armenian and Russian language skills (written and oral);\n- Computer knowledge;\n- Applicants must be female and 20-30 years old."}, {"name": "Peace Corps - Armenia", "location": "The Trainers will live in Dilidjan (driving time\nfrom Yerevan will be 1,5 hours)", "description": "As a member of the PST staff, the ICDC Coordinator is\nresponsible for design, implementation and evaluation of the community\ndevelopment and cross-culture competencies and implementation of ICDC\ntraining opportunities for all trainees.", "qualification": "- A University degree in Languages or Social Sciences is required;\n- The applicant must have experience with international teaching\nmethodologies: experience with curriculum development; demonstrated\nfacilitation and training skills;\n- Demonstrated cross-cultural experience;\n- Prior experience in supervision; prior experience in counseling;\n- Demonstrated flexibility and ability to work within strict time\nframes."}, {"name": "Armenian Association of Seismology and Physics of the Earth (AASPE)", "location": "Yerevan, Armenia", "description": "Armenian Association of Seismology and Physics of the\nEarth (AASPE) invites applications from highly qualified and experienced\nprofessionals for the post of Administrative Assistant.", "qualification": "- Excellent English, Armenian and Russian language skills (written and\noral); \n- Previous experience of working for international organizations will be\nan asset;\n- Excellent interpersonal and communication skills, strong\norganizational and time management skills are a must; \n- Advanced computer skills."}, {"name": "Joan B. Kroc Institute for Peace & Justice (IPJ)", "location": "NA", "description": "NA", "qualification": "NA"}, {"name": "The American Institutes for Research\nInternational Development Program", "location": "NA", "description": "The International Development Program of the American\nInstitutes for Research, a highly regarded not-for-profit social science\nresearch organization which provides applied social and behavior\nresearch and technical assistance to clients in developing countries,\nseeks a Project Associate to work on projects and proposals for the US\nAgency for International Development. This position is an opportunity to\ngain management experience and gain exposure to technical work with\nUSAID.", "qualification": "- Successful candidates will be self-starters with excellent\ncommunication, organizational, and written skills;\n- Fine attention to details;\n- Ability to deal with confidential information;\n- Experience with budgets;\n- Proficiency in Microsoft Excel;\n- Candidates will have a stable work history and a related degree or\nequivalent skills and experience;\n- Knowledge of USAID regulations, including budget/cost requirements,\nforeign language skills, and/or an interest in international development\nand/or education is preferred.\nREMUNERATION:   Salary commensurate with experience, plus excellent\nbenefits including 17 days paid time off, tuition reimbursement, and a\ntransportation subsidy."}, {"name": "The American Institutes for Research\nVocational Education Project, Macedonia", "location": "Skopje", "description": "The American Institutes for Research is seeking a\nChief of Party for a five-year secondary-school vocational education\ninitiative in Macedonia.", "qualification": "- Successful candidates will have an advanced degree in vocational\neducation or a related field;\n- Experience managing country reform projects; and prior experience in\ninternational educational reform;\n- Expertise in professional development for teachers and principals,\nsecondary school reform, or school-to-career activities required;\n- Experience with USAID is preferred;\n- Regional experience and language skills in Macedonian and/or Albanian\ndesired. \nREMUNERATION:   Salary competitively matched with qualifications."}, {"name": "Discovery Channel Global Education Fund", "location": "Silver Spring, Maryland", "description": "The position holder will manage DCGEF's Latin America\nprojects. S/he will continue to develop the DCGEF project in Latin\nAmerica by supervising project countries, developing strategies and\nfundraising for expansion, and continuing to help tailor this initiative\nto best meet the needs of under-resourced communities in Latin America;\nreport to DCGEF's Deputy Director. \nCandidates must have proper authorization to work in the U.S. No\nrelocation will be offered for this position. This is a contract\nposition with the Discovery Channel Global Education Fund.", "qualification": "- Education: BA/BS minimum;\n- Minimum 3-5 years of related international development experience in\nLatin America, preferably managing community and/or education\ndevelopment projects, fundraising, and partner development;\n-  Must be native Spanish speaker with excellent English written and\nverbal communication skills, excellent interpersonal skills and\ndiplomacy;\n- Prior experience working in Latin America and sensitivity to local\ncultures;\n- Ability to represent DCGEF to government officials as well as work\neffectively at a grassroots level;\n- Must demonstrate a management style that is inclusive, results\noriented and team based;\n- Keen ability to problem solving and prioritize multiple projects in a\nfast-paced environment in order to meet deadlines;\n- Candidate should be adept at networking, demonstrate excellent ability\nto think strategically, take initiative and exercise good judgment;\n- Proficient in Windows, Word, Excel, Power Point and database\nmanagement;\n- Fluency in Portuguese is a plus;\n- Must be able to travel for extended periods when necessary."}, {"name": "Save the Children", "location": "Yerevan, Armenia", "description": "Save the Children is seeking promising Scriptwriters\nfor a new Children's Television series promoting tolerance building and\ncritical thinking in interpersonal and community problem solving, as\nwell as cross-cultural communication skills. The series is designed to\nencourage children age five to eleven respect the dignity and worth of\nall people and to foster values critical to peace and democracy. The\ntelevision series will use traditional puppet characters designed\nlocally.  \nWe invite all interested parties to submit sample scripts, in Armenian,\nfor approximately nine-minute segment that includes not more than four\nfantasy characters (puppets). Save the Children will screen all scripts\nand choose small group of candidates for an interview in Yerevan. From\nthese candidates, six will be chosen to become scriptwriters for the\ntelevision program. Save the Children will consider signing the Service\nContract with the final candidates. \nSuccessful scripts will clearly promote:\n- Tolerance Building;\n- Critical thinking in Conflict Prevention;\n- Cross-cultural communication skills;\n- Mutual respect and tolerance for other cultures;\n- Peaceful solutions for all conflicts.", "qualification": "- Working knowledge of English and/or Russian languages;\n- Scripts should demonstrate creativity, humor, playfulness and be\nchild-friendly."}, {"name": "Women's Environment & Development Organization", "location": "New York, NY, USA", "description": "Women's Environment & Development Organization (WEDO)\nhas created a new leadership position of Deputy Director. This\nindividual's primary task will be to assist the Executive Director in\nproviding overall institutional leadership. In particular, the Deputy\nDirector will supervise all program areas, play a leadership role in\nfundraising and assist and support overall institutional management.", "qualification": "- Minimum of seven to ten years of senior level managerial experience,\nincluding some financial oversight responsibilities, in a nonprofit\norganization.\n- Excellent interpersonal skills and demonstrated capacity to build a\nteam-based approach to program management, including mentoring of\nprogram staff.\n- Work experience in Africa, Asia, Latin America or an international\nadvocacy organization. Experience in collaborating with international\nand regional activist and advocacy groups preferred.\n- Expertise in the field of international women's rights, preferably\nwith some knowledge and experience in one or more of the global issue\nareas of economic justice, governance or sustainable development.\n- Demonstrated track record in mobilizing resources from foundations,\ninternational agencies and other sources. Experience with grant writing\nis highly preferred.\n- Excellent written and verbal communication skills in English and\nability to represent the organization at a senior level in national and\ninternational arenas. Fluency in other languages is an asset. \n- Outstanding planning, management and administration skills.\n- Law degree or master degree in a relevant field in the social\nsciences, public policy or management (or related area)."}, {"name": "Horus Banque et Finance", "location": "Central Asia (Tajikistan)", "description": "Horus Banque et Finance seeks an expatriate\nMicrofinance Consultant for a new Micro-finance Institution in\nTadjikistan. S/he will participate in the development of a microfinance\ninstitution.", "qualification": "- Incumbent should have the ability to work without strong supervision\nas well as to co-operate with multidisciplinary team of experts in a\ndifficult environment;\n- Master in administration/ management;\n- Minimum ten years of professional experience;\n- Minimum five years of microfinance experience on the field;\n- Excellent written and spoken English language skills."}, {"name": "Caucasus Research Resource Centers - Armenia\nA Program of Eurasia Foundation", "location": "CRRC-Armenia center (Yerevan State University on 52 Abovyan\nStreet - \"Black\" building, 3rd floor, rooms #305-309.\nDear Colleagues:\nThe International Programs Center (IPC) of the United States Census\nBureau is partnering with CRRC-Armenia to present a lecture on survey\nsampling on 06 April 2004, to be given by an IPC expert in sampling.\nArmando Levinson\nMr. Armando Levinson has been working as a Mathematical Statistician\nwith the U.S. Census Bureau since 1980. He holds a Master's degree in\nStatistics from the University of Maryland, USA.  In his position within\nthe International Programs Center, Mr. Levinson travels extensively to\nprovide technical assistance for countries on sampling issues, and to\nconduct sampling workshops.  In 2001, he prepared \"Case Studies for\nSurveys and Censuses Sampling for Survey Statisticians.\nThe presentation on the topic:  \"Survey Sampling: Methodology and\nPractice\"\nwill be focused on (but not limited to) the following subjects:\n- Basic concepts of sampling (Sample statistics, population parameters\nand inference Sampling distribution, variance and bias; Sampling within\na survey error framework Confidence intervals; Design effects country\nrisks and opportunities: meaning and the importance of  analysis of\ncountries for the business purposes;\n- Stratified sampling (Proportionate and disproportionate\nstratification; Explicit and implicit stratification; Design effects due\nto variable sampling fractions); \n- Multistage sampling (Motivations for multistage sampling; Probability\nproportional to size sampling; Design effects due to clustering);\n- Sampling frames (Quality assessment for sampling frames; Methods for\nsampling households and persons; Methods for sampling telephone numbers;\nScreening methods; Flow sampling methods);\n- Accounting for sample design in analysis (Use of sample design\nweights; Estimation of complex standard errors; Post-survey\nre-evaluation of sample design; Examples).\nThe lecture will be presented in English, with translation into\nArmenian.", "description": "NA", "qualification": "NA"}, {"name": "World Vision Armenia", "location": "Armenia, Armenia", "description": "This full time position starting as of the second week\nof April is based in World Vision Armenia's National Office in Yerevan.\nCandidates must be flexible team players willing to work in a team of\nprofessionals.", "qualification": "- Candidates should have at least 3 years of work experience in\ncommunity development and experience in the preparation and successful\nattainment of major international grants;\n- Experience with USAID, CIDA, DFID, etc program design is a plus;\n- Must have excellent English writing skills, strong organizational\nskills, and knowledge of the program development cycle;\n- Candidates must have a University Degree in either international\ndevelopment, education, sociology and/or related subjects;\n- Must have interest and understanding of issues related to poverty,\ncivic society, health, child and youth development;\n- Should have good analytical skills and ability to use both\nquantitative and qualitative data in program design;\n- Must be able to travel throughout Armenia for about 25% of the working\ntime;\n- We are looking for candidates who have good communication, writing,\nand public speaking skills;\n- They should have excellent knowledge of the English language, fluent\nArmenian and Russian a plus;\n- They should have excellent computer skills with proficiency in both\nMicrosoft Word and Excel;\n- Must be creative and innovative;\n- Must have the capacity to work under pressure, in teams, and for long\nhours, if required.\nCandidates must be fully committed to World Vision's Christian basis of\nfaith and core values."}, {"name": "\"Antares\" Media Holding", "location": "Yerevan, Armenia", "description": "NA", "qualification": "- Age: 25 and more;\n- Minimum 3 years of related experience;\n- Higher education;\n- Excellent knowledge of Russian, Armenian and English (verbal &\nwritten);\n- Excellent interpersonal, communicational and organizational skills;\n- Dynamic personality;\n- Computer skills;\n- Must be able to prepare commercial offers and deal with different\nkinds of quotations;\n- Must have the abilities of both traffic and account managers i.e. to\nwork both with the clients and the personnel, to watch the\nimplementations of the orders."}, {"name": "Counterpart International", "location": "Yerevan, Armenia", "description": "The Counterpart International (CPI) Office in Yerevan\ninvites applications from highly qualified, energetic and experienced\nArmenian professionals for the post of Grants Manager.", "qualification": "- University degree and/or professional experience in Economics and\nGrant Management; \n- Fluency in spoken and written English, Armenian and Russian; \n- Experience working/implementing USAID funded projects; \n- Excellent communication and organizational skills. \n- Advanced computer skills, including Microsoft Word, Excel\n(spreadsheet) and Microsoft Outlook programs."}, {"name": "Counterpart International", "location": "Yerevan, Armenia", "description": "The Counterpart International (CPI) Office in Yerevan\ninvites applications from highly qualified, energetic and experienced\nArmenian professionals for the post of Project Assistant.", "qualification": "- University degree and/or professional experience in community\ndevelopment, advocacy or a related field (preferred) \n- Previous experience of working for international organizations; \n- Personal initiative as well as ability and willing to work as a team\nmember; \n- Excellent English, Armenian and Russian language skills (written and\noral);\n- A practical translation/ interpretation experience with legal\nterminology will be an asset;\n- Excellent interpersonal and communication skills, strong\norganizational and time management skills are a must;\n- Advanced computer skills, including Microsoft Word, Excel\n(spreadsheet) and Microsoft Outlook programs."}, {"name": "Counterpart International", "location": "Yerevan, Armenia", "description": "The Counterpart International (CPI) Office in Yerevan\ninvites applications from highly qualified, energetic and experienced\nArmenian professionals for the post of Finance Manager/Accountant.", "qualification": "- University degree in Finance, Economics or Accounting; \n- Formal education in western accounting practices and systems; \n- Demonstrated facility with computer software especially MS-Office,\nQuicken, and    \nQuick Books Pro; \n- Fluency in spoken and written English and proficiency in spoken\nArmenian and or/Russian; \n- Experience working on USAID-funded projects and implementing projects;\n- Experience in small grants administration and budget preparation and\nimplementation; and \n- Excellent communication and organizational skills; \n- Advanced computer skills, including Microsoft Word, Excel\n(spreadsheet) and Microsoft Outlook programs."}, {"name": "Antares Media Holding", "location": "Yerevan, Armenia", "description": "Antares Media Holding is looking for an experienced\nArtist - Designer.", "qualification": "- Specialized higher education;\n- At least 3 years experience in a similar organization;\n- Perfect knowledge of the following programs: Corel Draw, Adobe\nPhotoshop, Illustrator and Quark Xpress;\n- Ability to work under pressure and in multi-task environment;\n- Ability to work in a team while being self-directed and highly\nmotivated."}, {"name": "American Embassy Yerevan\nANNOUNCEMENT NUMBER: 04-10", "location": "NA", "description": "Performs secretary/receptionist duties; maintains\ncentral filing system for office use; types and arranges delivery of\nofficial correspondence. Maintains PAO's calendar. Prepares and\nmaintains general correspondence. Maintains records of leave and\nattendance. Provides translations from/to English, Armenian and Russian.\nA copy of the complete position description listing all duties and\nresponsibilities is available in the Human Resources Office. Contact\nnumber: (3741) 52-46-61", "qualification": "NOTE: All applicants are instructed to\naddress each selection criterion detailed below with specific and\ncomprehensive information supporting each criteria.\n- Completion of secondary school required;\n- Two years of clerical experience;\n- Level IV (fluent) in English, Armenian and Russian;\n- Must have basic computer skills. \nSELECTION PROCESS:   When equally qualified, Eligible Family Members and\nU.S. Veterans will be given preference. Therefore, it is essential that\nall candidates address the required qualifications above in the\napplication. \nADDITIONAL SELECTION CRITERIA: \n1. Management will consider nepotism/ conflict of interest, budget, and\nvisa status in determining successful candidacy.\n2. Current employees serving a probationary period are not eligible to\napply.\n3. Currently employed AEFMs who hold a FMA appointment are ineligible to\napply for advertised positions within the first 90 calendar days of\ntheir employment.  \nREMUNERATION:  *Not-Ordinarily Resident: Grade: FP-09 to be confirmed by\nWashington\n*Ordinarily Resident: Position Grade: FSN-5"}, {"name": "Microenterprise Development Fund \"Kamurj\"", "location": "Interviews will be conducted in villages close to\nVanadzor, Gyumri, Ijevan and Yerevan.", "description": "Interviewers will be responsible for collecting\nbaseline information about MDF-Kamurj client satisfaction by its current\nproducts and services, as well as about the loan demand in rural areas.\nA training session will be conducted before the actual start of the\ninterviews.", "qualification": "- Experience in conducting market research or sociological surveys;\n- Ability to work in rural areas;\n- Ability to work independently and as a team member. \nInterviewers should be available for the initial training in Yerevan on\n06 April ( at 10:00 - 18:00) and for 4-5 day interviews starting 12\nApril 2004. Each interviewer will conduct around 10-15 interviews daily.\nApplicants must be prepared to do some evening and weekend work when\nneeded. Transportation, food and accommodation will be provided by\nMDF-Kamurj."}, {"name": "Medecins Sans Frontieres - Belgium", "location": "Gegharkunik Marz, Armenia", "description": "Medecins Sans Frontieres - Belgium is seeking an IEC\nAssistant in the frame of Mental Health project implemented in\nGegharkunik Marz.", "qualification": "- Higher education in Social Sciences;\n- Presentation and communication skills;\n- Knowledge of social marketing;\n- Must be energetic and dynamic;\n- Self-organisational skills;\n- Ability to work in the field of mental health;\n- Excellent language skills in Armenian and English;\n- Computer literacy;\n- Affiliation with humanitarian action;\n- Previous media and NGO experiences are advantages;\n- Flexibility and readiness to travel frequently within the regions;\n- Availability to be based in Sevan during weekdays."}, {"name": "Tire Ltd.", "location": "Yerevan, Armenia", "description": "We are seeking Refurbish center manager with the\nproven ability to organize and run the department. He will work in close\ncooperation with the Company Executive Director and will report directly\nto him.", "qualification": "- University degree either in electronics, radio-physics or related\nfields;\n- At least 2 years progressive management experience;\n- Excellent organizational and communication skills; \n- Proven leadership skills and experience. The ideal candidate will be\nan aggressive self-starter with experience working in busy environments;\n- Must be fluent in Russian and Armenian both written and spoken\n(knowledge of English will be an asset)."}, {"name": "Global Village Energy Partnership", "location": "Likely the United Kingdom", "description": "The Global Village Energy Partnership (GVEP), a Type\nII Partnership launched at the World Summit on Sustainable Development\n(WSSD), is seeking a full-time Manager for the GVEP Technical\nSecretariat and broader Partnership. This individual will have lead\nresponsibility for management and operation of the GVEP Technical\nSecretariat and will report to the GVEP Board of Directors.", "qualification": "- At least 10 years experience in energy-development issues in\ndeveloping countries, particularly Africa, Asia, and/or Latin America. \n- Advanced degree in business and/or public administration, economics,\nfinance, engineering or related degree. \n- Demonstrated experience in program and project management, strategic\nplanning, resource mobilization and fund raising. \n- Strong client orientation, including experience in working with a\nrange of Government, civil society and donor counterparts. \n- Excellent written and verbal communications skills; ability to\ncommunicate ideas effectively and to write quickly and clearly. \n- English speaker, with language proficiencies in Spanish and/or French\ndesirable. \n- Willingness to relocate for this position and to conduct foreign\ntravel. \n- Strong interpersonal skills and demonstrated track record in working\nin a team setting; ability to balance multiple priorities and deadlines.\n- Ability to enhance the quality of Partnership products through early\nguidance, constructive feedback, encouraging innovation, and\nestablishing links with other networks and partners."}, {"name": "Helsinki Consulting Group", "location": "Thailand", "description": "The Helsinki Consulting Group is seeking for a\nEuropean Team Leader with strong implementation experience of health\nreform programmes in developing but especially in middle income\ncountries, and with extensive project management experience.", "qualification": "- University degree in social or health policy, health economics and/or\npublic health;\n- Supervisory and co-ordination skills for all technical, administrative\nand logistical aspects of the contract;\n- Should be a skilled negotiator, combining an ability to communicate\nwith tact and diplomacy, in an assertive manner Thailand EU TORs - Final\nversion October 2003 16 -17;\n- Sensitivity to Thai culture and customs is an asset;\n- Nationality of an EU country General professional experience;\n- At least 15 years of professional experience in the health sector in\ndeveloping countries, preferably in S.E. Asia combined with relevant\nexperience in Europe.\n- Extensive project and human management experience (he/she will manage\nteam composed of international and local specialists), preferably as TA\nteam leader/project director or manager in similar long-term projects;\n- Knowledge of the Project Cycle Management (PCM) and the EC Practical\nguide, as well as in budget and financial management;\nSpecific professional experience:\n- Specialist expertise of minimum of 5 years in at least one of the\nproject component areas and mainly in one of the following three: family\nmedicine/primary health care, financial management and hospital\nmanagement;\n- Strong implementation experience of health reform programmes in\ndeveloping but especially in middle income countries."}, {"name": "Yerevan Brandy Company", "location": "Yerevan, Armenia", "description": "NA", "qualification": "- University degree, preferably in Journalism;\n- At least 5 years of Public Relations experience;\n- Excellent knowledge of Armenian, Russian and English; knowledge of\nFrench is an asset;\n- Excellent knowledge of Mass Media in Armenia and Russia;\n- Familiarity with MS Word and MS Excel;\n- Outstanding written and verbal communication skills;\n- Ability to think and communicate strategically with a variety of\npeople.\nREMUNERATION:  Will be commensurate with the norms accepted in the\ncompany."}, {"name": "Yerevan Brandy Company", "location": "Yerevan, Armenia", "description": "Yerevan Brandy Company seeks qualified candidate to\nfill the position of Technical Security Engineer to work in the Risk\nManagement Department.", "qualification": "- Higher technical education;\n- At least 5 years of work experience in the sphere of security,\nparticularly labor technical security;\n- Knowledge of French or English (verbal and written);\n- Knowledge of MS Office.\nREMUNERATION:  Will be commensurate with the norms accepted in the\ncompany."}, {"name": "Barents Group of BearingPoint\nUSAID Commercial Law and Economic Regulation Program (CLERP)", "location": "Yerevan, Armenia", "description": "Barents Group is looking for a full-time translator\nfor a long-term project for translation and interpretation into/from\nEnglish, Russian, and Armenian.", "qualification": "- University degree in languages is preferred;\n- A minimum of three years of relevant experience;\n- Familiarity with economic/legal/corporate and technical terminology;\n- Strong working knowledge of MS Office, Excel, other applications, and\nInternet;\n- A strong work ethic and the ability to function in a pressured work\nenvironment; \n- Excellent communication skills; \n- The ability to work on a team."}, {"name": "Business Support Center", "location": "Yerevan, Armenia", "description": "Within the area of its specialization BSC seeks\nappropriate candidate to fill the Secretary/ Referent's position within\nthe Company staff.", "qualification": "- Higher education;\n- Fluent written and oral knowledge of Armenian, knowledge of Russian\nand English languages is compulsory;\n- Experience in translation and interpretation (English/Armenian,\nEnglish/Russian and vise versa);\n- Ability to work in team;\n- Excellent communication and interpersonal skills;\n- Personal initiative and creativity;\n- Excellent computer skills: MS Word, Excel (compulsory);\n- Deadline-oriented."}, {"name": "Microenterprise Development Fund Kamurj", "location": "Vanadzor, Armenia", "description": "MDF-Kamurj is currently looking to recruit a full\ntime Administrative Officer. S/he assists MDF-Kamurj's Yerevan office\nand branch offices in Gyumri, Vanadzor, Ijevan and Sisian in developing\nand establishing administrative systems.", "qualification": "- At least three year experience in office administration (preferably in\ninternational organizations);\n- Excellent communication skills and ability to work well with people;\n- Fluency and good writing skills in English are essential;\n- Typing and computer skills (Word and Excel);\n- Team player."}, {"name": "Barents Group of BearingPoint\nUSAID Commercial Law and Economic Regulation Program (CLERP)", "location": "Yerevan, Armenia", "description": "Barents Group is looking for a full-time translator\nfor a long-term project for translation and interpretation into/from\nEnglish, Russian, and Armenian.", "qualification": "- University degree in languages is preferred;\n- A minimum of 4 years of relevant experience;\n- Strong knowledge of and versatility with economic/legal/corporate and\ntechnical terminology;\n- Strong working knowledge of MS Office, Excel, other applications and\nInternet;\n- A strong work ethic and the ability to function in a pressured work\nenvironment; \n- Excellent communication skills; \n- The ability to work on a team."}, {"name": "Business Support Center", "location": "Yerevan, Armenia", "description": "Within the area of its specialization BSC seeks\nappropriate candidate to fill the Junior Business Consultant's position\nwithin the Company staff.", "qualification": "- Relevant higher education in business and management field;\n- Relevant experience (minimum 1 year experience in business\nconsulting);\n- Fluent written and oral knowledge of Armenian, Russian and English\nlanguages is compulsory;\n- Ability to work in team;\n- Excellent communication and interpersonal skills;\n- Personal initiative and creativity;\n- Excellent computer skills: MS Word, Excel (compulsory);\n- Deadline-oriented;\n- Willingness to travel.\nREMUNERATION:  Starting net salary-USD 100 (with increase potential\ndepending on performance)."}, {"name": "ZenteX.AM", "location": "Yerevan, Armenia", "description": "ZenteX.AM is seeking software developers to fill\npositions in its expanding development team. The primary directions are\nXML, Web Services, information processing and publishing.", "qualification": "We expect a successful candidate to be able to\n- Design and develop software products;\n- Create programs for heterogeneous environments (MS Windows, Unix)\ncommunicating by means of network protocols;\n- Author and maintain internal and end-user documentation.\nPREFERRED QUALIFICATIONS:  Applicants should have exposure to and\nprevious experience with\n- Programming languages: C, Perl (or Ruby, Python), and Java (or C#);\n- Data processing technologies: XML, relational databases.\nREMUNERATION:   Competitive"}, {"name": "Microenterprise Development Fund Kamurj", "location": "Yerevan, Armenia", "description": "MDF-Kamurj is currently looking to recruit a full\ntime Administrative Officer. S/he assists MDF-Kamurj's Yerevan office\nand branch offices in Gyumri, Vanadzor, Ijevan and Sisian in developing\nand establishing administrative systems.", "qualification": "- At least three year experience in office administration (preferably in\ninternational organizations);\n- Excellent communication skills and ability to work well with people;\n- Fluency and good writing skills in English are essential;\n- Typing and computer skills (Word and Excel);\n- Team player."}, {"name": "ACRA Credit Bureau", "location": "Yerevan, Armenia", "description": "ACRA Credit Bureau seeks female candidate to fill the\nSecretary/ Referent's position within the Company staff.", "qualification": "- Higher education;\n- Fluent written and oral knowledge of Armenian, Russian and English\nlanguages is compulsory;\n- Experience in translation and interpretation (English/Armenian,\nEnglish/Russian and vise versa);\n- Ability to work in team;\n- Excellent communication and interpersonal skills;\n- Personal initiative and creativity;\n- Excellent computer skills: MS Word, Excel (compulsory);\n- Deadline-oriented."}, {"name": "Colgate Palmolive Company / Derjava-S Company", "location": "Yerevan, Armenia", "description": "Derjava-S Company is looking for a Merchandiser who\nwill be responsible for all merchandising activities of company products\nconsidering company strategies.", "qualification": "- Hold a minimum high-school degree;\n- Experience in merchandising within a highly competitive environment\nwill be an asset (however it is not a prerequisite);\n- Demonstrate good communication and presentation skills;\n- Be up to 30 years old;\n- Holding a full valid driving license B and C will be an asset\n(however it is not a prerequisite)."}, {"name": "Colgate Palmolive Company / Derjava-S Company", "location": "Yerevan, Armenia", "description": "Derjava-S Company is looking for a Van-Salesman who\nwill be responsible for selling, distributing and merchandising of\ncompany products considering company strategies and also following up\nthe financial status of the customers.", "qualification": "- Hold a minimum high-school degree;\n- Be sales-driven and result-oriented. Experience in sales within a\nhighly competitive environment will be an asset (however it is not a\nprerequisite);\n- Demonstrate good communication and presentation skills;\n- Be up to 30 years old;\n- Holding a full valid driving license B and C."}, {"name": "Boomerang Software LLC", "location": "Yerevan, Armenia", "description": "Boomerang Software LLC is currently seeking qualified\ncandidates for a Technical Writer position. A technical writer is needed\nto write various documentation relating to Boomerang Softwares\nproducts, including user reference manuals and online help descriptions.", "qualification": "The minimum educational requirement is a BA\ndegree or equivalent degree in a related field of expertise;\n Candidates must be fluent in English, must have strong English writing\nskills, and should have extensive English writing experience;\n Candidates should have a good working knowledge of the Internet and be\nproficient in using Microsoft Windows and related programs;\n Candidates should also be able to type at least 50 words per minute;\n The person should have an analytical mind, be able to work\nindependently, and be willing to excel in a teamwork-based environment;\n Knowledge of HTML and basic Web page construction is required.\nExperience with Adobe PageMaker or other desktop publishing programs as\nwell as with Web design is preferred."}, {"name": "LadyDalieda", "location": "Yerevan, Armenia", "description": "Secretary office helper, Typing transitions from\nEnglish to Armenian, able to speck and understand English, Armenian and\nRussian, to answer the phone and make calls, arrange appointments,\nanswering the door and welcoming in customers.", "qualification": "MS Word & Excel programs"}, {"name": "Konvekt", "location": "Yerevan, Armenia", "description": "Konvekt Company is looking for a Van-Salesman who will\nbe responsible for selling, distributing and merchandising of company\nproducts considering company strategies and also following up the\nfinancial status of the customers.", "qualification": "- Hold a minimum high-school degree;\n- Be sales-driven and result-oriented. Experience in sales within a\nhighly competitive environment will be an asset;\n- Demonstrate good communication and presentation skills;\n- Be up to 30 years old;\n- Holding a full valid driving license 'B' and 'C'."}, {"name": "Media Diversity Institute", "location": "Stepanakert, Nagorno Karabakh Republic\nDETAIL DESCRIPTION:  Media Diversity Institute (MDI) accepts\napplications from journalists for participation in a three-day workshop\nfor journalists covering diversity reporting. The workshop will focus on\nthe full and objective coverage of both the majority and minorities \nusing both international and local examples and trainers. Workshop\nsessions, using a mixture of theory and practical exercises, will focus\non the way the media covers diversity issues, and how it could improve\nthat coverage.\nJournalists who currently work for mainstream media in Armenia and write\non or are interested in developing their writing on issues related to\ndiversity (ethnic minorities, religion, disability, marginalized and\nsocially disadvantaged groups etc) are eligible to apply.  MDI\nencourages applicants from the regions to apply for the workshop.\nThe training programme has been developed by Media Diversity Institute.\nTraining will be conducted from April 27th to April 28th in Stepanakert.\nAll the costs related to participation are covered by organizers of the\nevent.", "description": "NA", "qualification": "NA"}, {"name": "Media Diversity Institute", "location": "Yerevan and various regions of Armenia.\nDETAIL DESCRIPTION:  Media Diversity Institute (MDI) accepts\napplications from journalists for participation in a ten-day team\nreporting project for journalists to report and write joint feature\nstories under the supervision of outside team leaders. The resulting\nstories will be printed or broadcast by all media organizations\ninvolved, in identical versions, as agreed on by the team. Journalists\nwho currently work for mainstream media in Armenia and write on or are\ninterested in developing their writing on issues related to diversity\n(ethnic minorities, religion, disability, marginalized and socially\ndisadvantaged groups etc) are eligible to apply.  MDI encourages\napplicants from the regions to apply for the workshop.\nThe project will take place on May 1st to May 12th. All the costs\nrelated to participation are covered by organizers of the event. \nThe participating journalists will also be paid a participation fee to\ncompensate for the time away from their media outlets.", "description": "NA", "qualification": "NA"}, {"name": "edia Diversity Institute", "location": "Yerevan and various regions of Armenia.\nDETAIL DESCRIPTION:  Media Diversity Institute (MDI) accepts\napplications from journalists for participation in a ten-day team\nreporting project for journalists to report and write joint feature\nstories under the supervision of outside team leaders. The resulting\nstories will be printed or broadcast by all media organizations\ninvolved, in identical versions, as agreed on by the team. Journalists\nwho currently work for mainstream media in Armenia and write on or are\ninterested in developing their writing on issues related to diversity\n(ethnic minorities, religion, disability, marginalized and socially\ndisadvantaged groups etc) are eligible to apply.  MDI encourages\napplicants from the regions to apply for the workshop.\nThe project will take place on May 1st to May 12th. All the costs\nrelated to participation are covered by organizers of the event. \nThe participating journalists will also be paid a participation fee to\ncompensate for the time away from their media outlets.", "description": "NA", "qualification": "NA"}, {"name": "Dirol Cadbury", "location": "Yerevan, Armenia", "description": "Salesmen/ Trade Agents will be distributing &\ndisplaying imported cheweing gum and confectionary products on the\nassigned territory with their own cars.", "qualification": "- Excellent communication skills;\n- Team worker;\n- 20-35 years old;\n- Minimum 1 year driving experience;\n- Own car."}, {"name": "Mars LLC", "location": "Yerevan, Armenia", "description": "Mars LLC is looking for a Van Salesman/Trade Agent for\nConfectionery and a Van Salesman/Trade Agent for Pet Food. 100% of\nworking time in the field.", "qualification": "Higher education in Veterinary (for the\ncandidates of Trade Agents for Pet Food);\n- Driver's license. Minimum 1 year of driving experience;\n- Product Knowledge;\n- Basic selling skills;\n- Communication skills."}, {"name": "Armenia Social Transition Program (ASTP)", "location": "Vanadzor, Armenia", "description": "Abt Associates, Inc Representation in Armenia seeks\nenergetic candidates to fill the full time position of Project Assistant\nin USAID funded Armenia Social Transition Program (ASTP). Project\nAssistant supports one or more Project Specialists and Site Manager in\ncarrying out technical project work.", "qualification": "- Higher education;\n- Minimum 2 years of relevant working experience, preferably in\ninternational projects;\n- Advanced computer skills in MS Windows, Word, Excel, E-mail, Internet,\nknowledge of PowerPoint and Access will be an asset;\n- Ability to prioritize tasks, even when working under pressure in\nsystematic manner;\n- Armenian and English language proficiency is a must, fluency in\nRussian is an asset;\n- Excellent communication and interpersonal skills;\n- Strong organizational and time-management skills;\n- Ability to work both in a team and independently."}, {"name": "World Vision Armenia", "location": "Lori and Gegharkunik regions, Armenia", "description": "World Vision Armenia advertises for positions of Area\nDevelopment Programs (ADP) Managers for Lori and Gegharkunik regions.\nWorld Vision Armenia encourages strong, experienced and inspired\nmanagers in the area of civil society and community empowerment to apply\nfor either of these positions (work bases are in Lori Marz and\nGegharkunik Marz respectively) that will provide leadership and\noversight to the design, development and integration of the\ncommunity-based multi-sectoral initiatives in the area development\nprogram (ADP) in Lori and Gegharkunik regions.", "qualification": "A successful candidate for the ADP Manager\nposition will demonstrate the following qualifications and competencies:\n- Proven strong leadership, management and organizational skills;\n- Ability to manage multiple tasks and work under pressure;\n- Proven community and development management experience;\n- Strong skills in project design, implementation, monitoring,\nevaluation and report writing;\n- Proven knowledge/experience of working in the regions of Armenia;\n- Understanding of financial accountability, and budgeting skills;\nFamiliarity with grant management is desirable;\n- Experience with international NGOs or other similar organizations;\n- Good interpersonal skills and cross-cultural sensitivity;\n- Ability to establish and maintain relationship with local and\ninternational partners;\n- Team player attitude;\n- Efficiency in written and oral communication in English and Armenian;\nKnowledge of Russian is a plus; \n- Strong computer skills including: Microsoft Word, Excel, and Power\nPoint;\n- Willingness to be flexible with work hours when necessary as well as\nability to travel locally up to 40% of the time;\n- Understanding of and commitment to World Vision core values."}, {"name": "World Vision Armenia", "location": "Yerevan, Armenia", "description": "This full time position starting in April 2004 is\nbased out at World Vision Armenias National Office in Yerevan MMT\nproject. Candidates must be flexible team players willing to work in a\nteam of professionals.", "qualification": "- The successful candidate will possess valid driving license category\nB, proven driving experience of at least 5 years, good time management\nskills and ability to work under pressure.\n- Demonstrates conscientious attitude towards safe driving and car\nmaintenance. Must be a team player.\n- Experience with other international organizations is required.\n- Good knowledge of conversational English is preferred.\nCandidates must be fully in sympathy with World Visions Christian basis\nof faith and core values."}, {"name": "Armenia Social Transition Program (ASTP)", "location": "Vanadzor, Armenia", "description": "Abt Associates, Inc Representation in Armenia seeks\nenergetic candidates to fill the full time position of Project Assistant\nin USAID funded Armenia Social Transition Program (ASTP). Project\nAssistant supports one or more Project Specialists and Site Manager in\ncarrying out technical project work.", "qualification": "- Higher education;\n- Minimum 2 years of relevant working experience, preferably in\ninternational projects;\n- Advanced computer skills in MS Windows, Word, Excel, E-mail, Internet,\nknowledge of PowerPoint and Access will be an asset;\n- Ability to prioritize tasks, even when working under pressure in\nsystematic manner;\n- Armenian and English language proficiency is a must, fluency in\nRussian is an asset;\n- Excellent communication and interpersonal skills;\n- Strong organizational and time-management skills;\n- Ability to work both in a team and independently."}, {"name": "Boomerang Sosftware LLC", "location": "Yerevan, Armenia", "description": "Boomerang Software LLC is currently seeking\nindividuals for the position of Web Designer.", "qualification": "The successful candidate should meet the\nfollowing requirements:\n Excellent proficiency in Corel Draw and Photoshop;\n Operational skills and experience in Front Page, Macromedia Flash,\nMacromedia Dreamweaver, HTML, Java Script;\n Relevant work experience of minimum 2 years;\n Provide with the samples of work done (portfolio):  banners, web\npages, other graphics works."}, {"name": "Enterprise Incubator Foundation (EIF) & Armenian High-Tech Council of\nAmerica (AHTCA)", "location": "Yerevan, Armenia\nDETAIL DESCRIPTION:  April 28, 2004\n18.30 to 21.30\nAUA Business Center, room 501\n(Open to General Public)\nIn the increasingly Competitive global business environment and ever\nevolving complexities of software systems development, solid development\nprocesses must be obtained. Why do some software project succeed and\nother fail? It is mostly do the processes followed. Learn how you can\nuse these processes to create a repeatable, quality oriented,\ncontinuously improving software engineering organization.\nAttend an informative presentation on software improvement principles\nand learn how successful software organizations are built and\nmaintained.\nINSTRUCTOR:  Alexander Babkin, Process Improvement Manager of Motorola,\nGlobal Software Group Russia. \nAlexander has been working for Motorola for 4 years, leading\norganization's Software Engineering Process Group. As part of his\nresponsibilities, Alexander was involved in development and deployment\nof high maturity processes to satisfy CMM Level 5 requirements, provided\nprocess consultations to project managers, developed and delivered\nprocess related trainings and seminars, participated in software\nassessments of Motorola and non-Motorola organizations. During last year\nAlexander led the project devoted to CMMI transition. Alexander is\nMotorola Six Sigma Green Belt, and certified Motorola Software\nAssessor.\nApril 29-30, 2004\n9.30  17.30\nAUA Business Center, room 404\nLimited space available\nIdeal for business executives, software professionals and project\nmanagers\nDetails will be modified here once the details to the course outline are\ncompleted.\nIn the increasingly competitive global business environment and\ncomplexities in software development systems, solid development\nprocesses must be obtained.  Why do some project succeed and other fail?\nIt is mostly do the process followed and creating a repeatable, quality\noriented engineering process!\nAttend an informative presentation on software improvement principles\nand learn how successful software organizations are built and\nmaintained.\nINSTRUCTOR:  Alexander Babkin, Process Improvement Manager of Motorola,\nGlobal Software Group Russia. \nAlexander has been working for Motorola for 4 years, leading\norganization's Software Engineering Process Group. As part of his\nresponsibilities, Alexander was involved in development and deployment\nof high maturity processes to satisfy CMM Level 5 requirements, provided\nprocess consultations to project managers, developed and delivered\nprocess related trainings and seminars, participated in software\nassessments of Motorola and non-Motorola organizations. During last year\nAlexander led the project devoted to CMMI transition. Alexander is\nMotorola Six Sigma Green Belt, and certified Motorola Software Assessor.", "description": "NA", "qualification": "NA"}, {"name": "Enterprise Incubator Foundation (EIF) & Armenian High-Tech Council of\nAmerica (AHTCA)", "location": "Yerevan, Armenia\nDETAIL DESCRIPTION:  No Marketing, No Success Panel Discussion\nEIF and Armenian High-Tech Council of America (AHTCA) are pleased to\nannounce that during 3-5 May, 2004 we will present a unique opportunity\nfor IT sector business executives to participate in 3-days advanced\nworkshop on \"Developing Winning Marketing Plan\" for IT/High-Tech\nsectors, which is aimed to help participants increase their sales to\nexport markets and become more competitive in the global marketplace.\nThe workshop will be delivered by highly experienced US experts - Dikran\nGreg Krikorian, Roger Strauch, Harout Topsacalian and Dr. Yervant\nZorian.\nThe seminar will take place:\nMay 3, 2004\n17.00 pm to 19.00 pm\nAUA Business Center, room 501\n(Open to General Public)\nIN THE INCREASINGLY COMPETITIVE GLOBAL BUSINESS ENVIRONMENT, WHY DO\nCOMPANIES OF ALL SIZES CONSIDER MARKETING TO BE A KEY TO THEIR SUCCESS? \nFIND OUT WHY ARMENIAN COMPANIES MUST MASTER THIS ART IN ORDER TO\nSUCCEED!\nA MODERATED PANEL DISCUSSION WITH DISTINGUISHED GUESTS DISCUSSING THE\nIMPORTANCE OF MARKETING IN A GLOBAL ECONOMY. IN THE NEXT 3 DAYS, ATTEND\nAN INFORMATIVE PRESENTATION ON MARKETING PRINCIPLES, THAT WILL ALSO\nCOMBINE A HANDS-ON EXERCISE WHERE YOULL DEVELOP A MARKETING PLAN FOR A\nCASE STUDY HI-TECH BUSINESS.\nPANELISTS:  Roger Strauch, Chairman of The Roda Group.  The Roda Group\nis a venture development company, based in Berkeley, California. Mr.\nStrauchs firm, co-founded in 1997 with Dan Miller, provides\nentrepreneurs the environment, resources, and guidance to launch and\ngrow their high technology businesses.   The Roda Group's focus on the\ncreation of information technology companies has lead to seed and early\nstage investments in internet service, telecommunication, enterprise,\nand system software companies. \nDr. Yervant Zorian is the Vice-President and Chief Scientist at Virage\nLogic.  Dr. Zorian joined the Virage Logic management team as Vice\nPresident and Chief Scientist in 2000. Since1996, Dr. Zorian has served\nas Chief Technical Advisor of LogicVision. Prior to that, Dr. Zorian\nserved as a Distinguished Member of the Technical Staff at Lucent\nTechnologies, Bell Laboratories. \nMay 4  May 5, 2004\n9.00-18.00\nAUA Business Center, room 404\nLimited space available\nIdeal for business executives, academia and graduate students.\nATTEND THIS HANDS ON AND INTERACTIVE WORKSHOP TO LEARN A HANDS-ON\nAPPROACH ON HOW TO DEVELOP A MARKETING PLAN\n- Review the basics of a good marketing plan\n- Apply provided templates and samples to develop your marketing plan\n- Receive feedback and ask questions on your plan on the final day of\nthe course\n- Obtain links and resources for additional marketing know-how.\nWORKSHOP LEADERS:\nNOT JUST LISTENING BUT ACTIVE PARTICIPATION IN A WORKSHOP GIVEN BY\nSEASONED TECHNOLOGISTS ON DEVELOPING A MARKETING PLAN FOR YOUR BUSINESS!\nIN ADDITION TO A GENERAL BACKGROUND ON MARKETING PLANS, YOU WILL DEVELOP\nA MARKETING PLAN IN CLASS FOR YOUR BUSINESS BASED ON THE COURSE OUTLINE.\nTHE INSTRUCTORS WILL THEN BE AVAILABLE TO COMMENT ON THE PLAN AND ANSWER\nQUESTIONS. \nINSTRUCTORS:  Dikran Greg Krikorian, SME Business Consultant, New York,\nNY. \nDikran is currently an independent small business consultant with\nconsulting experience at firms such as Accenture and Ernst & Young.  He\nhas advised Fortune 500 companies and dozens of technology start-ups in\nthe areas of marketing, strategic planning, business plans, and raising\ncapital.  \nHarout Topsacalian, Executive V.P., CreationPoint Systems, New York,\nNY.\nHarout is co-founder and EVP of CreationPoint Systems, a network and IT\nsecurity software firm.  Harout is a former PricewaterhouseCoopers\nSenior Manager with US and international experience in consulting and\ntechnology.\nPlease, see attached the workshop detailed outline.", "description": "NA", "qualification": "NA"}, {"name": "\"Click\" Web Design", "location": "Yerevan, Armenia", "description": "The Web Developer/ Programmer will develop interactive\nwebsites.", "qualification": "- At least 2 years experience as a Web Developer/ Programmer with great\nskill in programming languages as ASP, JSP-Java Servlets, PHP, CGI,\nPerl, Cold Fusion, HTML, XHTML, CSS, JavaScript/VBScripts;\n- Good knowledge of database creation and maintenance, DBs such as\nMSSQL, Access, mySQL, Oracle;\n- Good web server knowledge as well as a good understanding of\ncommunication technologies such as TCP/IP, Proxies, FTP, and Shell;\n- Impressive portfolio of previous design work. (Please include links to\nrelevant work online that is old and/or recent as well as references to\nassist us in verifying the information that you provide);\n- Enthusiastic and communicative team member with a positive attitude,\ndedication and willingness to work hard often under high production\npressure;\n- Art or design qualifications would also be an advantage as would\ncomputer hardware, audio /visual, infrastructure, and networking;\n- Fair knowledge in English and a high standard of mathematics;\n- Ability to learn new Internet and authoring technologies relevant for\nweb site development."}]