[
  {
    "fn0": "Timestamp",
    "fn1": "First Name",
    "fn2": "Last Name",
    "fn3": "College",
    "fn4": "School Year",
    "fn5": "Major",
    "fn6": "Minor",
    "fn7": "Previous Projects",
    "fn8": "Work Experience",
    "fn9": "Top 5 Values",
    "fn10": "Preferred Roles (separated by commas eg. Data Science, Software Engineering)",
    "fn11": "Preferred Work Locations (separated by commas)",
    "fn12": "Skills (include programming languages separated by commas)",
    "fn13": "Spoken Languages",
    "fn14": "Hobbies"
  },
  {
    "fn0": "3/19/2019 12:41:12",
    "fn1": "Bryan ",
    "fn2": "Kamau",
    "fn3": "ENG",
    "fn4": "Masters (MEng, MBA)",
    "fn5": "Computer Science",
    "fn6": "Business",
    "fn7": "Hadas Project",
    "fn8": "ASML",
    "fn9": "Integrity, Discipline",
    "fn10": "Data Science, Software Engineering",
    "fn11": "NYC, LA, Philadelphia",
    "fn12": "OCaml, Python, JAVA, Excel, C",
    "fn13": "English, Kikuyu, Swahili",
    "fn14": "Soccer, Volunteer"
  },
  {
    "fn0": "4/8/2019 17:00:00",
    "fn1": "Jane",
    "fn2": "Doe",
    "fn3": "Engineering",
    "fn4": "Sophomore",
    "fn5": "Information Science",
    "fn6": "Psychology",
    "fn7": "Sudoku game written in OCaml\nAI Checkers robot that will play multiplayer checkers with someone written in Java\nPersonal website, uses HTML, CSS, JavaScript, Bootstrap, Flask\nCreated mathmetical model for regulating temperature of large volumes of water",
    "fn8": "Interned at Mathworks as a data scientist. Analyzed data usage of applications and created predictions of future trends and met and interviewed with potential customers\nTutored students for standardized testing in math, reading, english, science\nInterned at Adobe as a UI/UX designer, worked on the frontend of a mobile application",
    "fn9": "Balance, Innovation, Inclusiveness, Equality, Mentorship",
    "fn10": "Data Science, UI/UX Design, Software Engineering, Frontend Developer, Full Stack Developer, Artificial Intelligence",
    "fn11": "Seattle WA, San Francisco CA, New York City NY",
    "fn12": "Java, Python, JavaScript, R, Latex, Git, C++, Arduino, Matlab",
    "fn13": "English, Spanish, French",
    "fn14": "Music, piano, soccer, cooking, hip-hop dancing, volunteering"
  },
  {
    "fn0": "4/19/2019 0:30:43",
    "fn1": "Vivian ",
    "fn2": "Kiniga",
    "fn3": "Engineering",
    "fn4": "Masters (MEng, MBA)",
    "fn5": "Information Science",
    "fn6": "Business Minor",
    "fn7": "Web Design for a start-up company in San Francisco, CUApp Dev project team in Ithaca developing applications for the team, Relationship management and customer service for a bank in Kenya",
    "fn8": "I worked in cyber security for 5 years in New York City. Before that, I worked as a reliability and safety intern in Connecticut for a sailboat and engineering team.",
    "fn9": "Integrity, Honesty, Community, Customer First Mentality, Automate and get it done",
    "fn10": "Data Science, Front-end Design, Web Design, Software Design, Reliability, Testing and Safety, Engineering",
    "fn11": "New York City, Yerevan, Israel, Poland, San Francisco",
    "fn12": "python, java, customer service, communication, reporting",
    "fn13": "swahili, english, proficient in hebrew",
    "fn14": "soccer, running, swimming, cycling, reading, enjoying warm weather at a beach"
  }
]